Examples/CurryHoward.org
# -*- org-confirm-babel-evaluate: nil; -*-
#+TITLE: Embedding Example: Curry-Howard
#+AUTHOR: Petros Papapanagiotou
#+PROPERTY: header-args :results verbatim :session *OCaml* :exports both :eval no-export :tangle yes

#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+HTML_HEAD_EXTRA: <style type="text/css"> pre.src {background-color: #3E3D31; color: #F8F8F0;}</style>
#+OPTIONS: toc:4

* Introduction
** Loading the library

 The library can be loaded with a simple command:
 #+begin_src ocaml :results silent 
 loads ("embed/sequent.ml");;
 #+end_src

 This includes a small theory of multisets.

** Multiset notation

In an attempt to declutter multiset expressions, we adopt the following HOL Light notation:
- ~mempty~ : empty multiset
- Single quote ~'~: singleton multiset - e.g. ~' 5~ is ~{5}~.
- Hat ~^~: multiset sum (munion) - e.g. ~' 5 ^ ' 5 ^ ' 6~ is ~{5,5,6}~.

* A Simple Logic

We embed a simple propositional logic, limited to conjunction and implication. 

We will then try to prove a simple object-level theorem using vanilla HOL Light and our library.

** Embedding
*** Type Declaration
    We define propositional terms as a recursive type ~Prop~:

    #+begin_src ocaml :results silent :cache yes 
let prop_INDUCT,prop_RECURSION = define_type
                                   "Prop = Truth
                                    | Product Prop Prop
                                    | Implies Prop Prop";;    
    #+end_src

    We also add some syntax sugar. Namely, we set ~-->~ as the infix operator for implication (~Implies~) and ~%~ as the infix operator for conjunction (~Product~):

#+begin_src ocaml :results silent
parse_as_infix("-->",(13,"right"));;
override_interface("-->",`Implies`);;
parse_as_infix("%",(14,"right"));;
override_interface("%",`Product`);;
#+end_src

