docs/CurryHoward.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-06 Sun 16:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Embedding Example: Curry-Howard</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Petros Papapanagiotou" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Embedding Example: Curry-Howard</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8a84f39">1. Introduction</a>
<ul>
<li><a href="#org00e4026">1.1. Loading the library</a></li>
<li><a href="#org4b89870">1.2. Multiset notation</a></li>
</ul>
</li>
<li><a href="#org8316459">2. A Simple Logic</a>
<ul>
<li><a href="#org558fdee">2.1. Embedding</a>
<ul>
<li><a href="#org1425201">2.1.1. Type Declaration</a></li>
<li><a href="#org17c920a">2.1.2. Inference rules</a></li>
</ul>
</li>
<li><a href="#org0109a9a">2.2. Proofs</a>
<ul>
<li><a href="#org16302ae">2.2.1. Vanilla HOL Light</a></li>
<li><a href="#org2aa0ac9">2.2.2. Using our library</a></li>
<li><a href="#org3ba9645">2.2.3. Explicit Instantiation</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf49f1d4">3. Curry-Howard</a>
<ul>
<li><a href="#orgf641ec3">3.1. Embedding</a>
<ul>
<li><a href="#org5d6a231">3.1.1. Lambda Terms</a></li>
<li><a href="#org708099a">3.1.2. Type Annotations</a></li>
<li><a href="#orga7d77d3">3.1.3. Inference Rules</a></li>
</ul>
</li>
<li><a href="#orgd94c0a1">3.2. Proofs</a>
<ul>
<li><a href="#org1f50656">3.2.1. A Construction Proof</a></li>
<li><a href="#org2441c29">3.2.2. A Type-checking Proof</a></li>
<li><a href="#org9172a6d">3.2.3. Proving and Reusing Lemmas</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org8a84f39" class="outline-2">
<h2 id="org8a84f39"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org00e4026" class="outline-3">
<h3 id="org00e4026"><span class="section-number-3">1.1</span> Loading the library</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The library can be loaded with a simple command:
</p>
<div class="org-src-container">
<pre class="src src-ocaml">loads <span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"embed/sequent.ml"</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
This includes a small theory of multisets.
</p>
</div>
</div>

<div id="outline-container-org4b89870" class="outline-3">
<h3 id="org4b89870"><span class="section-number-3">1.2</span> Multiset notation</h3>
<div class="outline-text-3" id="text-1-2">
<p>
In an attempt to declutter multiset expressions, we adopt the following HOL Light notation:
</p>
<ul class="org-ul">
<li><code>mempty</code> : empty multiset</li>
<li>Single quote <code>'</code>: singleton multiset - e.g. <code>' 5</code> is <code>{5}</code>.</li>
<li>Hat <code>^</code>: multiset sum (munion) - e.g. <code>' 5 ^ ' 5 ^ ' 6</code> is <code>{5,5,6}</code>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org8316459" class="outline-2">
<h2 id="org8316459"><span class="section-number-2">2</span> A Simple Logic</h2>
<div class="outline-text-2" id="text-2">
<p>
We embed a simple propositional logic, limited to conjunction and implication. 
</p>

<p>
We will then try to prove a simple object-level theorem using vanilla HOL Light and our library.
</p>
</div>

<div id="outline-container-org558fdee" class="outline-3">
<h3 id="org558fdee"><span class="section-number-3">2.1</span> Embedding</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org1425201" class="outline-4">
<h4 id="org1425201"><span class="section-number-4">2.1.1</span> Type Declaration</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
We define propositional terms as a recursive type <code>Prop</code>:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #FD971F;">prop_INDUCT</span>,<span style="color: #FD971F;">prop_RECURSION</span> = define_type
                                   <span style="color: #E6DB74;">"Prop = Truth</span>
<span style="color: #E6DB74;">                                    | Product Prop Prop</span>
<span style="color: #E6DB74;">                                    | Implies Prop Prop"</span><span style="color: #ff4500;">;;</span>    
</pre>
</div>

<p>
We also add some syntax sugar. Namely, we set <code>--&gt;</code> as the infix operator for implication (<code>Implies</code>) and <code>%</code> as the infix operator for conjunction (<code>Product</code>):
</p>

<div class="org-src-container">
<pre class="src src-ocaml">parse_as_infix<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"--&gt;"</span>,<span style="color: #66D9EF;">(</span>13,<span style="color: #E6DB74;">"right"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
override_interface<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"--&gt;"</span>,<span style="color: #F8F8F2; background-color: #272822;">`Implies</span>`<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
parse_as_infix<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"%"</span>,<span style="color: #66D9EF;">(</span>14,<span style="color: #E6DB74;">"right"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
override_interface<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"%"</span>,<span style="color: #F8F8F2; background-color: #272822;">`Product</span>`<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
