Examples/CurryHoward.org
*** Inference rules
    First we introduce an infix operator for logical consequence, i.e. the "/turnstile/". 

#+begin_src ocaml :results silent
parse_as_infix("|=",(11,"right"));;
#+end_src

We then provide an inductive definition for the operator based on the inference rules. Each line (conjunct) in the definition corresponds to one inference rule, in the following order:
1) Identity (~ID~)
2) Weakening (~W~)
3) Contraction (~C~)
4) Cut (~Cut~)
5) Conjunction Right (~RX~)
6) Conjunction Left1 (~L1X~)
7) Conjunction Left2 (~L2X~)
8) Implication Left (~L-->~)
9) Implication Right (~R-->~)

#+begin_src ocaml -n 0 :results silent :cache yes 
let propRULES,propINDUCT,propCASES = new_inductive_definition 
`(!a. ' a |= a) /\
(!G a c. (G |= c) ==> (G ^ ' a |= c)) /\
(!G a c. (G ^ ' a ^ ' a |= c) ==> (G ^ ' a |= c)) /\
(!G D a c. (G |= a) /\ (D ^ ' a |= c) ==> (G ^ D |= c)) /\
(!G D a b. (G |= a) /\ (D |= b) ==> (G ^ D |= a % b)) /\
(!G a b c. (G ^ ' a |= c) ==> (G ^ ' (a % b) |= c)) /\
(!G a b c. (G ^ ' b |= c) ==> (G ^ ' (a % b) |= c)) /\
(!G D a b c. (G ^ ' b |= c) /\ (D |= a) ==> (G ^ D ^ ' (a --> b) |= c)) /\
(!G a b. (G ^ ' a |= b) ==> (G |= (a --> b)))
` ;;
#+end_src

We now break up the definition into the individual rules. We also do some pre-processing to get them ready to be used as (embedded) "meta-rules". We keep unprocessed, primed versions of the rules as well, to demonstrate how a proof would work out using vanilla HOL Light.

#+begin_src ocaml :results silent
let [pID;
     pW; pC; pCut; 
     pX_R; pX_L1; pX_L2;
     pI_L; pI_R
    ] = 
  map (MIMP_RULE o SPEC_ALL o REWRITE_RULE[IMP_CONJ]) 
    (CONJUNCTS propRULES);;

let [pID';
     pW'; pC'; pCut'; 
     pX_R'; pX_L1'; pX_L2';
     pI_L'; pI_R'
    ] = (CONJUNCTS propRULES);;
#+end_src

** Proofs

