docs/CurryHoward.html

<div id="outline-container-org17c920a" class="outline-4">
<h4 id="org17c920a"><span class="section-number-4">2.1.2</span> Inference rules</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
First we introduce an infix operator for logical consequence, i.e. the &ldquo;<i>turnstile</i>&rdquo;. 
</p>

<div class="org-src-container">
<pre class="src src-ocaml">parse_as_infix<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"|="</span>,<span style="color: #66D9EF;">(</span>11,<span style="color: #E6DB74;">"right"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
We then provide an inductive definition for the operator based on the inference rules. Each line (conjunct) in the definition corresponds to one inference rule, in the following order:
</p>
<ol class="org-ol">
<li>Identity (<code>ID</code>)</li>
<li>Weakening (<code>W</code>)</li>
<li>Contraction (<code>C</code>)</li>
<li>Cut (<code>Cut</code>)</li>
<li>Conjunction Right (<code>RX</code>)</li>
<li>Conjunction Left1 (<code>L1X</code>)</li>
<li>Conjunction Left2 (<code>L2X</code>)</li>
<li>Implication Left (<code>L--&gt;</code>)</li>
<li>Implication Right (<code>R--&gt;</code>)</li>
</ol>

<div class="org-src-container">
<pre class="src src-ocaml"><span class="linenr"> 0: </span><span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #FD971F;">propRULES</span>,<span style="color: #FD971F;">propINDUCT</span>,<span style="color: #FD971F;">propCASES</span> = new_inductive_definition 
<span class="linenr"> 1: </span>`<span style="color: #AE81FF;">(</span><span style="color: #F8F8F0;">!</span>a. ' a <span style="color: #F8F8F0;">|=</span> a<span style="color: #AE81FF;">)</span> /\
<span class="linenr"> 2: </span><span style="color: #AE81FF;">(</span><span style="color: #F8F8F0;">!</span><span style="color: #F8F8F2; background-color: #272822;">G</span> a c. <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">|=</span> c<span style="color: #66D9EF;">)</span> ==&gt; <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' a <span style="color: #F8F8F0;">|=</span> c<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> /\
<span class="linenr"> 3: </span><span style="color: #AE81FF;">(</span><span style="color: #F8F8F0;">!</span><span style="color: #F8F8F2; background-color: #272822;">G</span> a c. <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' a <span style="color: #F8F8F0;">^</span> ' a <span style="color: #F8F8F0;">|=</span> c<span style="color: #66D9EF;">)</span> ==&gt; <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' a <span style="color: #F8F8F0;">|=</span> c<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> /\
<span class="linenr"> 4: </span><span style="color: #AE81FF;">(</span><span style="color: #F8F8F0;">!</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F2; background-color: #272822;">D</span> a c. <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">|=</span> a<span style="color: #66D9EF;">)</span> /\ <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">D</span> <span style="color: #F8F8F0;">^</span> ' a <span style="color: #F8F8F0;">|=</span> c<span style="color: #66D9EF;">)</span> ==&gt; <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> <span style="color: #F8F8F2; background-color: #272822;">D</span> <span style="color: #F8F8F0;">|=</span> c<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> /\
<span class="linenr"> 5: </span><span style="color: #AE81FF;">(</span><span style="color: #F8F8F0;">!</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F2; background-color: #272822;">D</span> a b. <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">|=</span> a<span style="color: #66D9EF;">)</span> /\ <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">D</span> <span style="color: #F8F8F0;">|=</span> b<span style="color: #66D9EF;">)</span> ==&gt; <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> <span style="color: #F8F8F2; background-color: #272822;">D</span> <span style="color: #F8F8F0;">|=</span> a <span style="color: #F8F8F0;">%</span> b<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> /\
<span class="linenr"> 6: </span><span style="color: #AE81FF;">(</span><span style="color: #F8F8F0;">!</span><span style="color: #F8F8F2; background-color: #272822;">G</span> a b c. <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' a <span style="color: #F8F8F0;">|=</span> c<span style="color: #66D9EF;">)</span> ==&gt; <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' <span style="color: #A6E22E;">(</span>a <span style="color: #F8F8F0;">%</span> b<span style="color: #A6E22E;">)</span> <span style="color: #F8F8F0;">|=</span> c<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> /\
<span class="linenr"> 7: </span><span style="color: #AE81FF;">(</span><span style="color: #F8F8F0;">!</span><span style="color: #F8F8F2; background-color: #272822;">G</span> a b c. <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' b <span style="color: #F8F8F0;">|=</span> c<span style="color: #66D9EF;">)</span> ==&gt; <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' <span style="color: #A6E22E;">(</span>a <span style="color: #F8F8F0;">%</span> b<span style="color: #A6E22E;">)</span> <span style="color: #F8F8F0;">|=</span> c<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> /\
<span class="linenr"> 8: </span><span style="color: #AE81FF;">(</span><span style="color: #F8F8F0;">!</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F2; background-color: #272822;">D</span> a b c. <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' b <span style="color: #F8F8F0;">|=</span> c<span style="color: #66D9EF;">)</span> /\ <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">D</span> <span style="color: #F8F8F0;">|=</span> a<span style="color: #66D9EF;">)</span> ==&gt; <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> <span style="color: #F8F8F2; background-color: #272822;">D</span> <span style="color: #F8F8F0;">^</span> ' <span style="color: #A6E22E;">(</span>a --&gt; b<span style="color: #A6E22E;">)</span> <span style="color: #F8F8F0;">|=</span> c<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> /\
<span class="linenr"> 9: </span><span style="color: #AE81FF;">(</span><span style="color: #F8F8F0;">!</span><span style="color: #F8F8F2; background-color: #272822;">G</span> a b. <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' a <span style="color: #F8F8F0;">|=</span> b<span style="color: #66D9EF;">)</span> ==&gt; <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">|=</span> <span style="color: #A6E22E;">(</span>a --&gt; b<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span class="linenr">10: </span>` <span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
We now break up the definition into the individual rules. We also do some pre-processing to get them ready to be used as (embedded) &ldquo;meta-rules&rdquo;. We keep unprocessed, primed versions of the rules as well, to demonstrate how a proof would work out using vanilla HOL Light.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #AE81FF;">[</span><span style="color: #FD971F;">pID</span>;
     <span style="color: #FD971F;">pW</span>; <span style="color: #FD971F;">pC</span>; <span style="color: #FD971F;">pCut</span>; 
     <span style="color: #FD971F;">pX_R</span>; <span style="color: #FD971F;">pX_L1</span>; <span style="color: #FD971F;">pX_L2</span>;
     <span style="color: #FD971F;">pI_L</span>; <span style="color: #FD971F;">pI_R</span>
    <span style="color: #AE81FF;">]</span> = 
  map <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">MIMP_RULE</span> o <span style="color: #F8F8F2; background-color: #272822;">SPEC_ALL</span> o <span style="color: #F8F8F2; background-color: #272822;">REWRITE_RULE</span><span style="color: #66D9EF;">[</span><span style="color: #F8F8F2; background-color: #272822;">IMP_CONJ</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span> 
    <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">CONJUNCTS</span> propRULES<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>

<span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #AE81FF;">[</span><span style="color: #FD971F;">pID'</span>;
     <span style="color: #FD971F;">pW'</span>; <span style="color: #FD971F;">pC'</span>; <span style="color: #FD971F;">pCut'</span>; 
     <span style="color: #FD971F;">pX_R'</span>; <span style="color: #FD971F;">pX_L1'</span>; <span style="color: #FD971F;">pX_L2'</span>;
     <span style="color: #FD971F;">pI_L'</span>; <span style="color: #FD971F;">pI_R'</span>
    <span style="color: #AE81FF;">]</span> = <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">CONJUNCTS</span> propRULES<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
</div>
