Examples/CurryHoward.org
*** Vanilla HOL Light

Set the goal:
#+begin_src ocaml
g `mempty |= X % Y --> Y % X` ;;
#+end_src

#+RESULTS[5e65f2ab0598e98ba7fb0c4af0bcd2a5d148df00]:
: Warning: Free variables in goal: X, Y
: val it : goalstack = 1 subgoal (1 total)
: 
: `mempty |= X % Y --> Y % X`

Apply ~R-->~:
#+begin_src ocaml
e (MATCH_MP_TAC pI_R');;
#+end_src

#+RESULTS[5f5e63308fce0ac375b672ed9684ddab490de5fc]:
: val it : goalstack = 1 subgoal (1 total)
: 
: `mempty^' (X % Y) |= Y % X`

Now we want to apply contraction:

#+begin_src ocaml
pC';;
#+end_src

#+RESULTS[eb8ec6bfe3245399eccf22f3ba0adcfba5e49fb8]:
: val it : thm = |- !G a c. G^' a^' a |= c ==> G^' a |= c

We are lucky that, thanks to the empty multiset, the rule matches directly so that:
- ~G~ = ~mempty~
- ~a~ = ~X % Y~
- ~c~ = ~Y % X~

#+begin_src ocaml
e (MATCH_MP_TAC pC');;
#+end_src

#+RESULTS[206b50ee1f9cc5e475bc136a48d1c45dd7a8d0b6]:
: val it : goalstack = 1 subgoal (1 total)
: 
: `mempty^' (X % Y)^' (X % Y) |= Y % X`

Now we want to apply ~RX~:

#+begin_src ocaml
pX_R';;
#+end_src

#+RESULTS[e564dcc833a29e6a8ca09d3536dc4463e9e02504]:
: val it : thm = |- !G D a b. G |= a /\ D |= b ==> G^D |= a % b

This time we are not as lucky. We want the left-hand side of the turnstile in the goal to match the form ~G^D~. If we apply the rule directly we will get the following match:
- ~G~ = ~mempty~
- ~D~ = ~' (X % Y)^' (X % Y)~

The result is not what we want:
#+begin_src ocaml
e (MATCH_MP_TAC pX_R');;
#+end_src

#+RESULTS[462832403557de071ad2a92be6c3397b7f6ebb57]:
: val it : goalstack = 1 subgoal (1 total)
: 
: `mempty |= Y /\ ' (X % Y)^' (X % Y) |= X`

So we backtrack. We can use the ~MUNION_EMPTY2~ to get rid of the empty multiset:
#+begin_src ocaml 
b();;
MUNION_EMPTY2;;
#+end_src

#+RESULTS:
: val it : thm = |- (mempty^M) = M

So we use rewritting:

#+begin_src ocaml
e (REWRITE_TAC[MUNION_EMPTY2]);;
#+end_src

#+RESULTS[999468af3cc8df8d636947f9608bf9fceed91c49]:
: val it : goalstack = 1 subgoal (1 total)
: 
: `' (X % Y)^' (X % Y) |= Y % X`

Now the rule will give us what we wanted:

#+begin_src ocaml
e (MATCH_MP_TAC pX_R');;
#+end_src

#+RESULTS[462832403557de071ad2a92be6c3397b7f6ebb57]:
: val it : goalstack = 1 subgoal (1 total)
: 
: `' (X % Y) |= Y /\ ' (X % Y) |= X`

We use ~CONJ_TAC~ to break our conjunction to 2 subgoals:
#+begin_src ocaml
e (CONJ_TAC);;
#+end_src

#+RESULTS[3a7de111f9206aed836b7b190e69a037e43257b7]:
: val it : goalstack = 2 subgoals (2 total)
: 
: `' (X % Y) |= X`
: 
: `' (X % Y) |= Y`

Now we want to use the ~L2X~ rule:
#+begin_src ocaml
pX_L2';;
#+end_src

#+RESULTS:
: val it : thm = |- !G a b c. G^' b |= c ==> G^' (a % b) |= c

...but we can't, because we have nothing to match to ~G~:

#+begin_src ocaml
e (MATCH_MP_TAC pX_L2');;
#+end_src

#+RESULTS:
: Exception: Failure "MATCH_MP_TAC: No match".

We need to add an empty multiset, so that ~G = mempty~. One way to do this is by introducing the exact form that we want as a subgoal. We use rewritting with ~MUNION_EMPTY2~ to prove that the new subgoal is equivalent to the original:


#+begin_src ocaml
e (SUBGOAL_THEN (`mempty ^ '(X % Y) |= Y`)
     (fun th -> ACCEPT_TAC (REWRITE_RULE[MUNION_EMPTY2] th)));;
#+end_src

#+RESULTS[ccd3c04cd1f5c34eadd800ed59d9901114a9ad22]:
: val it : goalstack = 1 subgoal (2 total)
: 
: `mempty^' (X % Y) |= Y`

Now we can use the rule:

#+begin_src ocaml
e (MATCH_MP_TAC pX_L2');;
#+end_src

#+RESULTS[7b85addfd103daf8967c6d7642e2e4069f2b88a0]:
: val it : goalstack = 1 subgoal (2 total)
: 
: `mempty^' Y |= Y`

Getting rid of the empty multiset again, as ~ID~ will not like it:

#+begin_src ocaml
e (REWRITE_TAC[MUNION_EMPTY2]);;
#+end_src

#+RESULTS[999468af3cc8df8d636947f9608bf9fceed91c49]:
: val it : goalstack = 1 subgoal (2 total)
: 
: `' Y |= Y`

The identity rule completes this branch of the proof:

#+begin_src ocaml
e (MATCH_ACCEPT_TAC pID);;
#+end_src

#+RESULTS[1b4ba3e9ef27ec164f7d82cfc94e808d9cb0e0d2]:
: val it : goalstack = 1 subgoal (1 total)
: 
: `' (X % Y) |= X`

The second branch is symmetrical:

#+begin_src ocaml
e (SUBGOAL_THEN (`mempty ^ '(X % Y) |= X`)
     (fun th -> ACCEPT_TAC (REWRITE_RULE[MUNION_EMPTY2] th)));;
e (MATCH_MP_TAC pX_L1' THEN REWRITE_TAC[MUNION_EMPTY2] THEN MATCH_ACCEPT_TAC pID);;
#+end_src

#+RESULTS[0f0ce854eeaf344229f686381fa54fc2e7f5b910]:
: val it : goalstack = No subgoals

Our proof is complete, so we can reconstruct the theorem we just proved. This also validates the whole proof:

#+begin_src ocaml
top_thm();;
#+end_src

#+RESULTS[568cab6783398e57cf606b526d3333026b350b8a]:
: val it : thm = |- mempty |= X % Y --> Y % X

