docs/CurryHoward.html

<div id="outline-container-org0109a9a" class="outline-3">
<h3 id="org0109a9a"><span class="section-number-3">2.2</span> Proofs</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org16302ae" class="outline-4">
<h4 id="org16302ae"><span class="section-number-4">2.2.1</span> Vanilla HOL Light</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Set the goal:
</p>
<div class="org-src-container">
<pre class="src src-ocaml">g <span style="color: #F8F8F2; background-color: #272822;">`mempty</span> <span style="color: #F8F8F0;">|=</span> <span style="color: #F8F8F2; background-color: #272822;">X</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">Y</span> --&gt; <span style="color: #F8F8F2; background-color: #272822;">Y</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">X</span>` <span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
Warning: Free variables in goal: X, Y
val it : goalstack = 1 subgoal (1 total)

`mempty |= X % Y --&gt; Y % X`
</pre>


<p>
Apply <code>R--&gt;</code>:
</p>
<div class="org-src-container">
<pre class="src src-ocaml">e <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">MATCH_MP_TAC</span> pI_R'<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (1 total)

`mempty^' (X % Y) |= Y % X`
</pre>


<p>
Now we want to apply contraction:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">pC'<span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : thm = |- !G a c. G^' a^' a |= c ==&gt; G^' a |= c
</pre>


<p>
We are lucky that, thanks to the empty multiset, the rule matches directly so that:
</p>
<ul class="org-ul">
<li><code>G</code> = <code>mempty</code></li>
<li><code>a</code> = <code>X % Y</code></li>
<li><code>c</code> = <code>Y % X</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-ocaml">e <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">MATCH_MP_TAC</span> pC'<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (1 total)

`mempty^' (X % Y)^' (X % Y) |= Y % X`
</pre>


<p>
Now we want to apply <code>RX</code>:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">pX_R'<span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : thm = |- !G D a b. G |= a /\ D |= b ==&gt; G^D |= a % b
</pre>


<p>
This time we are not as lucky. We want the left-hand side of the turnstile in the goal to match the form <code>G^D</code>. If we apply the rule directly we will get the following match:
</p>
<ul class="org-ul">
<li><code>G</code> = <code>mempty</code></li>
<li><code>D</code> = <code>' (X % Y)^' (X % Y)</code></li>
</ul>

<p>
The result is not what we want:
</p>
<div class="org-src-container">
<pre class="src src-ocaml">e <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">MATCH_MP_TAC</span> pX_R'<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (1 total)

`mempty |= Y /\ ' (X % Y)^' (X % Y) |= X`
</pre>


<p>
So we backtrack. We can use the <code>MUNION_EMPTY2</code> to get rid of the empty multiset:
</p>
<div class="org-src-container">
<pre class="src src-ocaml">b<span style="color: #AE81FF;">()</span><span style="color: #ff4500;">;;</span>
<span style="color: #F8F8F2; background-color: #272822;">MUNION_EMPTY2</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : thm = |- (mempty^M) = M
</pre>


<p>
So we use rewritting:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">e <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">REWRITE_TAC</span><span style="color: #66D9EF;">[</span><span style="color: #F8F8F2; background-color: #272822;">MUNION_EMPTY2</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (1 total)

`' (X % Y)^' (X % Y) |= Y % X`
</pre>


<p>
Now the rule will give us what we wanted:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">e <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">MATCH_MP_TAC</span> pX_R'<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (1 total)

`' (X % Y) |= Y /\ ' (X % Y) |= X`
</pre>


<p>
We use <code>CONJ_TAC</code> to break our conjunction to 2 subgoals:
</p>
<div class="org-src-container">
<pre class="src src-ocaml">e <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">CONJ_TAC</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 2 subgoals (2 total)

`' (X % Y) |= X`

`' (X % Y) |= Y`
</pre>


<p>
Now we want to use the <code>L2X</code> rule:
</p>
<div class="org-src-container">
<pre class="src src-ocaml">pX_L2'<span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : thm = |- !G a b c. G^' b |= c ==&gt; G^' (a % b) |= c
</pre>


<p>
&#x2026;but we can&rsquo;t, because we have nothing to match to <code>G</code>:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">e <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">MATCH_MP_TAC</span> pX_L2'<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
Exception: Failure "MATCH_MP_TAC: No match".
</pre>


<p>
We need to add an empty multiset, so that <code>G = mempty</code>. One way to do this is by introducing the exact form that we want as a subgoal. We use rewritting with <code>MUNION_EMPTY2</code> to prove that the new subgoal is equivalent to the original:
</p>


<div class="org-src-container">
<pre class="src src-ocaml">e <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">SUBGOAL_THEN</span> <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">`mempty</span> <span style="color: #F8F8F0;">^</span> '<span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">X</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">Y</span><span style="color: #A6E22E;">)</span> <span style="color: #F8F8F0;">|=</span> <span style="color: #F8F8F2; background-color: #272822;">Y</span>`<span style="color: #66D9EF;">)</span>
     <span style="color: #66D9EF;">(</span><span style="color: #F92672;">fun</span> <span style="color: #FD971F;">th</span> -&gt; <span style="color: #F8F8F2; background-color: #272822;">ACCEPT_TAC</span> <span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">REWRITE_RULE</span><span style="color: #E6DB74;">[</span><span style="color: #F8F8F2; background-color: #272822;">MUNION_EMPTY2</span><span style="color: #E6DB74;">]</span> th<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (2 total)

`mempty^' (X % Y) |= Y`
</pre>


<p>
Now we can use the rule:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">e <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">MATCH_MP_TAC</span> pX_L2'<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (2 total)

`mempty^' Y |= Y`
</pre>


<p>
Getting rid of the empty multiset again, as <code>ID</code> will not like it:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">e <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">REWRITE_TAC</span><span style="color: #66D9EF;">[</span><span style="color: #F8F8F2; background-color: #272822;">MUNION_EMPTY2</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (2 total)

`' Y |= Y`
</pre>


<p>
The identity rule completes this branch of the proof:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">e <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">MATCH_ACCEPT_TAC</span> pID<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (1 total)

`' (X % Y) |= X`
</pre>


<p>
The second branch is symmetrical:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">e <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">SUBGOAL_THEN</span> <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">`mempty</span> <span style="color: #F8F8F0;">^</span> '<span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">X</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">Y</span><span style="color: #A6E22E;">)</span> <span style="color: #F8F8F0;">|=</span> <span style="color: #F8F8F2; background-color: #272822;">X</span>`<span style="color: #66D9EF;">)</span>
     <span style="color: #66D9EF;">(</span><span style="color: #F92672;">fun</span> <span style="color: #FD971F;">th</span> -&gt; <span style="color: #F8F8F2; background-color: #272822;">ACCEPT_TAC</span> <span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">REWRITE_RULE</span><span style="color: #E6DB74;">[</span><span style="color: #F8F8F2; background-color: #272822;">MUNION_EMPTY2</span><span style="color: #E6DB74;">]</span> th<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
e <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">MATCH_MP_TAC</span> pX_L1' <span style="color: #F8F8F2; background-color: #272822;">THEN</span> <span style="color: #F8F8F2; background-color: #272822;">REWRITE_TAC</span><span style="color: #66D9EF;">[</span><span style="color: #F8F8F2; background-color: #272822;">MUNION_EMPTY2</span><span style="color: #66D9EF;">]</span> <span style="color: #F8F8F2; background-color: #272822;">THEN</span> <span style="color: #F8F8F2; background-color: #272822;">MATCH_ACCEPT_TAC</span> pID<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = No subgoals
</pre>


<p>
Our proof is complete, so we can reconstruct the theorem we just proved. This also validates the whole proof:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">top_thm<span style="color: #AE81FF;">()</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : thm = |- mempty |= X % Y --&gt; Y % X
</pre>
</div>
</div>
