Examples/CurryHoward.org
*** Using our library

We reset the goal to the initial state. This time we will use our library:
#+begin_src ocaml
g `mempty |= X % Y --> Y % X` ;;
#+end_src

#+RESULTS:
: Warning: Free variables in goal: X, Y
: val it : goalstack = 1 subgoal (1 total)
: 
: `mempty |= X % Y --> Y % X`

The sequence of the rules is exactly the same, starting with ~R-->~. 

The ~eseq~ command is an extension of ~e~ for our extended (embedded *seq*uent calculus) tactics. 

The ~ruleseq~ tactic uses any embedded sequent calculus rule in a backwards reasoning step (as ~MATCH_MP_TAC~ does):

#+begin_src ocaml
eseq (ruleseq pI_R);;
#+end_src

#+RESULTS:
: val it : goalstack = 1 subgoal (1 total)
: 
: `' (X % Y) |= Y % X`

No empty multisets appear this time. Now we can use ~C~ directly:

#+begin_src ocaml
eseq (ruleseq pC);;
#+end_src

#+RESULTS:
: val it : goalstack = 1 subgoal (1 total)
: 
: `' (X % Y)^' (X % Y) |= Y % X`

Again, no empty multiset to clutter our goal. We can use ~RX~ and it will match directly:

#+begin_src ocaml
eseq (ruleseq pX_R);;
#+end_src

#+RESULTS:
: val it : goalstack = 2 subgoals (2 total)
: 
: `' (X % Y) |= X`
: 
: `' (X % Y) |= Y`

Notice that the subgoals were also split automatically without explicit ~CONJ_TAC~.

Even though we are in the same state as before, without an empty multiset to match ~G~, we can apply ~L2X~ with no problems:

#+begin_src ocaml
eseq (ruleseq pX_L2);;
#+end_src

#+RESULTS:
: val it : goalstack = 1 subgoal (2 total)
: 
: `' Y |= Y`

And finish it off with ~ID~:
#+begin_src ocaml
eseq (ruleseq pID);;
#+end_src

#+RESULTS:
: val it : goalstack = 1 subgoal (1 total)
: 
: `' (X % Y) |= X`

Symmetrically for the second branch:
#+begin_src ocaml
eseq (ruleseq pX_L1);;
eseq (ruleseq pID);;
#+end_src

#+RESULTS:
: val it : goalstack = No subgoals

The proof validates fine, and we get the same theorem:

#+begin_src ocaml
top_thm();;
#+end_src

#+RESULTS:
: val it : thm = |- mempty |= X % Y --> Y % X


*** Explicit Instantiation 

Now, let's revisit this goal:
#+begin_src ocaml
g `' (X % Y)^' (X % Y) |= Y % X` ;;
#+end_src

#+RESULTS:
: Warning: Free variables in goal: X, Y
: val it : goalstack = 1 subgoal (1 total)
: 
: `' (X % Y)^' (X % Y) |= Y % X`

In vanilla HOL Light we had an extra ~mempty~ lying around, so applying ~RX~ gave us the match ~G = mempty~. Using our library there is no empty multiset to match to ~G~. 

The question is, what if we /actually wanted/ ~G~ to be matched to an empty multiset and all of the rest of the context to go into ~D~? 

We can still do this by explicitly instantiating our rule, using ~rule_seqtac~:
#+begin_src ocaml
eseq (rule_seqtac [`D`,`' (X % Y)^' (X % Y)`] pX_R) ;;
#+end_src

#+RESULTS:
: Warning: inventing type variables
: val it : goalstack = 2 subgoals (2 total)
: 
: `' (X % Y)^' (X % Y) |= X`
: 
: `mempty |= Y`

Note that we have provided no typing information for ~D~, ~X~, or ~Y~, yet the system did not complain. It figured out and instantiated the types on its own. 

We could also instantiate ~G~ to ~mempty~. However, we do need to provide the type of ~mempty~ in that case, because it cannot be found in the goal and we can therefore not determine its type automatically:

#+begin_src ocaml
b();;
eseq (rule_seqtac [`G`,`mempty:(Prop)multiset`] pX_R) ;;
#+end_src

#+RESULTS:
: Warning: inventing type variables
: Warning: inventing type variables
: val it : goalstack = 2 subgoals (2 total)
: 
: `' (X % Y)^' (X % Y) |= X`
: 
: `mempty |= Y`

Even though there was no ~mempty~ in the original goal, the system managed to apply the rule as we wanted.

* Curry-Howard
** Embedding
