docs/CurryHoward.html

<div id="outline-container-org2aa0ac9" class="outline-4">
<h4 id="org2aa0ac9"><span class="section-number-4">2.2.2</span> Using our library</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
We reset the goal to the initial state. This time we will use our library:
</p>
<div class="org-src-container">
<pre class="src src-ocaml">g <span style="color: #F8F8F2; background-color: #272822;">`mempty</span> <span style="color: #F8F8F0;">|=</span> <span style="color: #F8F8F2; background-color: #272822;">X</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">Y</span> --&gt; <span style="color: #F8F8F2; background-color: #272822;">Y</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">X</span>` <span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
Warning: Free variables in goal: X, Y
val it : goalstack = 1 subgoal (1 total)

`mempty |= X % Y --&gt; Y % X`
</pre>


<p>
The sequence of the rules is exactly the same, starting with <code>R--&gt;</code>. 
</p>

<p>
The <code>eseq</code> command is an extension of <code>e</code> for our extended (embedded *seq*uent calculus) tactics. 
</p>

<p>
The <code>ruleseq</code> tactic uses any embedded sequent calculus rule in a backwards reasoning step (as <code>MATCH_MP_TAC</code> does):
</p>

<div class="org-src-container">
<pre class="src src-ocaml">eseq <span style="color: #AE81FF;">(</span>ruleseq pI_R<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (1 total)

`' (X % Y) |= Y % X`
</pre>


<p>
No empty multisets appear this time. Now we can use <code>C</code> directly:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">eseq <span style="color: #AE81FF;">(</span>ruleseq pC<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (1 total)

`' (X % Y)^' (X % Y) |= Y % X`
</pre>


<p>
Again, no empty multiset to clutter our goal. We can use <code>RX</code> and it will match directly:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">eseq <span style="color: #AE81FF;">(</span>ruleseq pX_R<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 2 subgoals (2 total)

`' (X % Y) |= X`

`' (X % Y) |= Y`
</pre>


<p>
Notice that the subgoals were also split automatically without explicit <code>CONJ_TAC</code>.
</p>

<p>
Even though we are in the same state as before, without an empty multiset to match <code>G</code>, we can apply <code>L2X</code> with no problems:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">eseq <span style="color: #AE81FF;">(</span>ruleseq pX_L2<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (2 total)

`' Y |= Y`
</pre>


<p>
And finish it off with <code>ID</code>:
</p>
<div class="org-src-container">
<pre class="src src-ocaml">eseq <span style="color: #AE81FF;">(</span>ruleseq pID<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (1 total)

`' (X % Y) |= X`
</pre>


<p>
Symmetrically for the second branch:
</p>
<div class="org-src-container">
<pre class="src src-ocaml">eseq <span style="color: #AE81FF;">(</span>ruleseq pX_L1<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
eseq <span style="color: #AE81FF;">(</span>ruleseq pID<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = No subgoals
</pre>


<p>
The proof validates fine, and we get the same theorem:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">top_thm<span style="color: #AE81FF;">()</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : thm = |- mempty |= X % Y --&gt; Y % X
</pre>
</div>
</div>


<div id="outline-container-org3ba9645" class="outline-4">
<h4 id="org3ba9645"><span class="section-number-4">2.2.3</span> Explicit Instantiation</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Now, let&rsquo;s revisit this goal:
</p>
<div class="org-src-container">
<pre class="src src-ocaml">g `' <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">X</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">Y</span><span style="color: #AE81FF;">)</span><span style="color: #F8F8F0;">^</span>' <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">X</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">Y</span><span style="color: #AE81FF;">)</span> <span style="color: #F8F8F0;">|=</span> <span style="color: #F8F8F2; background-color: #272822;">Y</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">X</span>` <span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
Warning: Free variables in goal: X, Y
val it : goalstack = 1 subgoal (1 total)

`' (X % Y)^' (X % Y) |= Y % X`
</pre>


<p>
In vanilla HOL Light we had an extra <code>mempty</code> lying around, so applying <code>RX</code> gave us the match <code>G = mempty</code>. Using our library there is no empty multiset to match to <code>G</code>. 
</p>

<p>
The question is, what if we <i>actually wanted</i> <code>G</code> to be matched to an empty multiset and all of the rest of the context to go into <code>D</code>? 
</p>

<p>
We can still do this by explicitly instantiating our rule, using <code>rule_seqtac</code>:
</p>
<div class="org-src-container">
<pre class="src src-ocaml">eseq <span style="color: #AE81FF;">(</span>rule_seqtac <span style="color: #66D9EF;">[</span><span style="color: #F8F8F2; background-color: #272822;">`D</span>`,`' <span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">X</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">Y</span><span style="color: #A6E22E;">)</span><span style="color: #F8F8F0;">^</span>' <span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">X</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">Y</span><span style="color: #A6E22E;">)</span>`<span style="color: #66D9EF;">]</span> pX_R<span style="color: #AE81FF;">)</span> <span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
Warning: inventing type variables
val it : goalstack = 2 subgoals (2 total)

`' (X % Y)^' (X % Y) |= X`

`mempty |= Y`
</pre>


<p>
Note that we have provided no typing information for <code>D</code>, <code>X</code>, or <code>Y</code>, yet the system did not complain. It figured out and instantiated the types on its own. 
</p>

<p>
We could also instantiate <code>G</code> to <code>mempty</code>. However, we do need to provide the type of <code>mempty</code> in that case, because it cannot be found in the goal and we can therefore not determine its type automatically:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">b<span style="color: #AE81FF;">()</span><span style="color: #ff4500;">;;</span>
eseq <span style="color: #AE81FF;">(</span>rule_seqtac <span style="color: #66D9EF;">[</span><span style="color: #F8F8F2; background-color: #272822;">`G</span>`,<span style="color: #F8F8F2; background-color: #272822;">`mempty</span>:<span style="color: #A6E22E;">(</span><span style="color: #66D9EF;">Prop</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">multiset`</span><span style="color: #66D9EF;">]</span><span style="color: #66D9EF;"> pX_R</span><span style="color: #AE81FF;">)</span> <span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
Warning: inventing type variables
Warning: inventing type variables
val it : goalstack = 2 subgoals (2 total)

`' (X % Y)^' (X % Y) |= X`

`mempty |= Y`
</pre>


<p>
Even though there was no <code>mempty</code> in the original goal, the system managed to apply the rule as we wanted.
</p>
</div>
</div>
</div>
</div>
