Examples/CurryHoward.org
*** Lambda Terms
   We begin by defining the lambda terms as a recursive type ~Lambda~:

    #+begin_src ocaml :results silent :cache yes 
let lamINDUCT,lamRECURSION = define_type
                               " Lambda = Var A
                                | App Lambda Lambda
                                | Prod (Lambda#Lambda)
                                | Lam A Lambda
                                ";; 
    #+end_src

Our type is polymorphic to the type of the variable names. Typically this will be a ~string~, but it alternative types may be used to facilitate substitutions, freshness conditions, etc.

    We add ~@@~ as an infix operator for function application (~App~):

#+begin_src ocaml :results silent
parse_as_infix("@@",(10,"right"));; 
override_interface("@@",`App`);;
#+end_src

Normally projections would be primitively defined as part of the syntax. Cut elimination then yields their functionality. We are only working on shallow embeddings and object-level reasoning. We cannot perform cut elimination at this level. Because of this, we define projections as functions, so that they are more practical.

The definitions rely on ~FST~ and ~SND~ which are functions over pairs in HOL Light. Constant and function names in HOL Light are case sensitive, so we can use ~Fst~ and ~Snd~:

#+begin_src ocaml :results silent :cache yes
let lamFst_DEF = new_recursive_definition lamRECURSION 
                   `Fst (Prod x :(A)Lambda) = FST x` ;; 

let lamFst = prove (`!x y. Fst (Prod (x,y)) = x`, REWRITE_TAC[lamFst_DEF;FST]);;


let lamSnd_DEF = new_recursive_definition lamRECURSION 
                   `Snd (Prod x :(A)Lambda) = SND x` ;; 

let lamSnd = prove (`!x y. Snd (Prod (x,y)) = y`, REWRITE_TAC[lamSnd_DEF;SND]);;
#+end_src

*** Type Annotations

    We want to be able to annotate lambda terms with propositions as types. We actually make this a little more general than that, so we can annotate /any/ term with types:
    #+begin_src ocaml :results silent :cache yes 
    let tmINDUCT,tmRECURSION = define_type "TTerm = Annotate A Prop";; 
    #+end_src

Using a variable type ~A~ makes the defined ~TTerm~ polymorphic. For lambdas, the type will be ~((A)Lambda)TTerm~ for some ~A~ (the type of variable names).


    We add ~::~ as an infix typing operator (we cannot use ~:~ because it is the HOL Light typing operator):

#+begin_src ocaml :results silent
parse_as_infix("::",(16,"right"));;
override_interface("::",`Annotate`);;
#+end_src

In HOL Light, it is fairly easy to install a custom printer that hides the lambda terms from our proofs. This makes it easier to focus on the logical proof without worrying about the computational terms:

#+begin_src ocaml :results silent :cache yes
let chTermString tm =
  try 
    let c,args = strip_comb tm in
    let op = (fst o dest_const) c in
    if (String.equal op "Annotate") 
    then (string_of_term o hd o tl) args 
    else failwith ""
  with Failure _ -> failwith "Not a Curry-Howard term." ;;

let print_chTerm fmt = pp_print_string fmt o chTermString ;;

let hide_lam,show_lam =
  (fun () -> install_user_printer ("print_chTerm",print_chTerm)),
  (fun () -> try delete_user_printer "print_chTerm"
             with Failure _ -> failwith ("show_procs: " ^
                                           "Curry-Howard lambda terms are already being shown normally."));;

hide_lam();;
#+end_src

We can hide lambda terms using ~hide_lam()~ or re-enable them using ~show_lam()~.

