docs/CurryHoward.html

<div id="outline-container-orgf49f1d4" class="outline-2">
<h2 id="orgf49f1d4"><span class="section-number-2">3</span> Curry-Howard</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf641ec3" class="outline-3">
<h3 id="orgf641ec3"><span class="section-number-3">3.1</span> Embedding</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org5d6a231" class="outline-4">
<h4 id="org5d6a231"><span class="section-number-4">3.1.1</span> Lambda Terms</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
We begin by defining the lambda terms as a recursive type <code>Lambda</code>:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #FD971F;">lamINDUCT</span>,<span style="color: #FD971F;">lamRECURSION</span> = define_type
                               <span style="color: #E6DB74;">" Lambda = Var A</span>
<span style="color: #E6DB74;">                                | App Lambda Lambda</span>
<span style="color: #E6DB74;">                                | Prod (Lambda#Lambda)</span>
<span style="color: #E6DB74;">                                | Lam A Lambda</span>
<span style="color: #E6DB74;">                                "</span><span style="color: #ff4500;">;;</span> 
</pre>
</div>

<p>
Our type is polymorphic to the type of the variable names. Typically this will be a <code>string</code>, but it alternative types may be used to facilitate substitutions, freshness conditions, etc.
</p>

<p>
We add <code>@@</code> as an infix operator for function application (<code>App</code>):
</p>

<div class="org-src-container">
<pre class="src src-ocaml">parse_as_infix<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"@@"</span>,<span style="color: #66D9EF;">(</span>10,<span style="color: #E6DB74;">"right"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span> 
override_interface<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"@@"</span>,<span style="color: #F8F8F2; background-color: #272822;">`App</span>`<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
Normally projections would be primitively defined as part of the syntax. Cut elimination then yields their functionality. We are only working on shallow embeddings and object-level reasoning. We cannot perform cut elimination at this level. Because of this, we define projections as functions, so that they are more practical.
</p>

<p>
The definitions rely on <code>FST</code> and <code>SND</code> which are functions over pairs in HOL Light. Constant and function names in HOL Light are case sensitive, so we can use <code>Fst</code> and <code>Snd</code>:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #FD971F;">lamFst_DEF</span> = new_recursive_definition lamRECURSION 
                   <span style="color: #F8F8F2; background-color: #272822;">`Fst</span> <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">Prod</span> x :<span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">A</span><span style="color: #66D9EF;">)</span><span style="color: #66D9EF;">Lambda</span><span style="color: #AE81FF;">)</span> = <span style="color: #F8F8F2; background-color: #272822;">FST</span> x` <span style="color: #ff4500;">;;</span> 

<span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #FD971F;">lamFst</span> = prove <span style="color: #AE81FF;">(</span>`<span style="color: #F8F8F0;">!</span>x y. <span style="color: #F8F8F2; background-color: #272822;">Fst</span> <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">Prod</span> <span style="color: #A6E22E;">(</span>x,y<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span> = x`, <span style="color: #F8F8F2; background-color: #272822;">REWRITE_TAC</span><span style="color: #66D9EF;">[</span>lamFst_DEF;<span style="color: #F8F8F2; background-color: #272822;">FST</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>


<span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #FD971F;">lamSnd_DEF</span> = new_recursive_definition lamRECURSION 
                   <span style="color: #F8F8F2; background-color: #272822;">`Snd</span> <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">Prod</span> x :<span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">A</span><span style="color: #66D9EF;">)</span><span style="color: #66D9EF;">Lambda</span><span style="color: #AE81FF;">)</span> = <span style="color: #F8F8F2; background-color: #272822;">SND</span> x` <span style="color: #ff4500;">;;</span> 

<span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #FD971F;">lamSnd</span> = prove <span style="color: #AE81FF;">(</span>`<span style="color: #F8F8F0;">!</span>x y. <span style="color: #F8F8F2; background-color: #272822;">Snd</span> <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">Prod</span> <span style="color: #A6E22E;">(</span>x,y<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span> = y`, <span style="color: #F8F8F2; background-color: #272822;">REWRITE_TAC</span><span style="color: #66D9EF;">[</span>lamSnd_DEF;<span style="color: #F8F8F2; background-color: #272822;">SND</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org708099a" class="outline-4">
<h4 id="org708099a"><span class="section-number-4">3.1.2</span> Type Annotations</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
We want to be able to annotate lambda terms with propositions as types. We actually make this a little more general than that, so we can annotate <i>any</i> term with types:
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #FD971F;">tmINDUCT</span>,<span style="color: #FD971F;">tmRECURSION</span> = define_type <span style="color: #E6DB74;">"TTerm = Annotate A Prop"</span><span style="color: #ff4500;">;;</span> 
</pre>
</div>

<p>
Using a variable type <code>A</code> makes the defined <code>TTerm</code> polymorphic. For lambdas, the type will be <code>((A)Lambda)TTerm</code> for some <code>A</code> (the type of variable names).
</p>


<p>
We add <code>::</code> as an infix typing operator (we cannot use <code>:</code> because it is the HOL Light typing operator):
</p>

<div class="org-src-container">
<pre class="src src-ocaml">parse_as_infix<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"::"</span>,<span style="color: #66D9EF;">(</span>16,<span style="color: #E6DB74;">"right"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
override_interface<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"::"</span>,<span style="color: #F8F8F2; background-color: #272822;">`Annotate</span>`<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
In HOL Light, it is fairly easy to install a custom printer that hides the lambda terms from our proofs. This makes it easier to focus on the logical proof without worrying about the computational terms:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #A6E22E;">chTermString</span> <span style="color: #FD971F;">tm</span> =
  <span style="color: #F92672;">try</span> 
    <span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #FD971F;">c</span>,<span style="color: #FD971F;">args</span> = strip_comb tm <span style="color: #FD5FF0; font-weight: bold;">in</span>
    <span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #FD971F;">op</span> = <span style="color: #AE81FF;">(</span>fst o dest_const<span style="color: #AE81FF;">)</span> c <span style="color: #FD5FF0; font-weight: bold;">in</span>
    <span style="color: #F92672;">if</span> <span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">String.</span>equal op <span style="color: #E6DB74;">"Annotate"</span><span style="color: #AE81FF;">)</span> 
    <span style="color: #F92672;">then</span> <span style="color: #AE81FF;">(</span>string_of_term o hd o tl<span style="color: #AE81FF;">)</span> args 
    <span style="color: #F92672;">else</span> <span style="color: #F92672;">failwith</span> <span style="color: #E6DB74;">""</span>
  <span style="color: #F92672;">with</span> <span style="color: #F92672;">Failure</span> _ -&gt; <span style="color: #F92672;">failwith</span> <span style="color: #E6DB74;">"Not a Curry-Howard term."</span> <span style="color: #ff4500;">;;</span>

<span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #A6E22E;">print_chTerm</span> <span style="color: #FD971F;">fmt</span> = pp_print_string fmt o chTermString <span style="color: #ff4500;">;;</span>

<span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #FD971F;">hide_lam</span>,<span style="color: #FD971F;">show_lam</span> =
  <span style="color: #AE81FF;">(</span><span style="color: #F92672;">fun</span> <span style="color: #66D9EF;">()</span> -&gt; install_user_printer <span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"print_chTerm"</span>,print_chTerm<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>,
  <span style="color: #AE81FF;">(</span><span style="color: #F92672;">fun</span> <span style="color: #66D9EF;">()</span> -&gt; <span style="color: #F92672;">try</span> delete_user_printer <span style="color: #E6DB74;">"print_chTerm"</span>
             <span style="color: #F92672;">with</span> <span style="color: #F92672;">Failure</span> _ -&gt; <span style="color: #F92672;">failwith</span> <span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"show_procs: "</span> <span style="color: #F8F8F0;">^</span>
                                           <span style="color: #E6DB74;">"Curry-Howard lambda terms are already being shown normally."</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>

hide_lam<span style="color: #AE81FF;">()</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
We can hide lambda terms using <code>hide_lam()</code> or re-enable them using <code>show_lam()</code>.
</p>
</div>
</div>
