Examples/CurryHoward.org
*** Inference Rules 
  As before, we introduce an infix operator for logical consequence, i.e. the "/turnstile/". We use a different symbol so that both embedding can co-exist:

 #+begin_src ocaml :results silent
 parse_as_infix("|==",(11,"right"));
 #+end_src

 We introduce the inference rules in the same way and order as before:
 1) Identity (~ID~)
 2) Weakening (~W~)
 3) Contraction (~C~)
 4) Cut (~Cut~)
 5) Conjunction Right (~RX~)
 6) Conjunction Left1 (~L1X~)
 7) Conjunction Left2 (~L2X~)
 8) Implication Left (~L-->~)
 9) Implication Right (~R-->~)

 #+begin_src ocaml -n 0 :results silent :cache yes 
let chRULES,chINDUCT,chCASES = new_inductive_definition 
`(!a x. ' (x :: a) |== x :: a) /\
(!G a c x z. (G |== z :: c) ==> (G ^ ' (x :: a) |== z :: c)) /\
(!G a c x z. (G ^ '(x :: a) ^ '(x :: a) |== z :: c) ==> (G ^ ' (x :: a) |== z :: c)) /\
(!G D a c x z. (G |== z :: a) /\ (D ^ ' (z :: a) |== x :: c) ==> (G ^ D |== x :: c)) /\
(!G D a b x y. (G |== x :: a) /\ (D |== y :: b) ==> (G ^ D |== Prod (x,y) :: (a % b))) /\
(!G a b c x z. (G ^ ' (Fst x :: a) |== (z :: c)) ==> (G ^ ' (x :: (a % b)) |== (z :: c))) /\
(!G a b c x z. (G ^ ' (Snd x :: b) |== (z :: c)) ==> (G ^ ' (x :: (a % b)) |== (z :: c))) /\
(!G D a b c f y z. (G ^ ' ((f @@ y) :: b) |== z :: c) /\ (D |== (y :: a)) ==> (G ^ D ^ ' (f :: (a --> b)) |== z :: c)) /\
(!G a b x y. (G ^ ' (Var x :: a) |== (y :: b)) ==> (G |== Lam x y :: (a --> b)))
` ;;
 #+end_src

The only difference is that we use annotated terms (~TTerm~s) instead of propositions (~Prop~s), so we include the corresponding Curry-Howard terms in each rule.

As before, we break up and pre-process our rules, ready for use in our system:

 #+begin_src ocaml :results silent
let [chID;
     chW; chC; chCut; 
     chX_R; chX_L1; chX_L2;
     chI_L; chI_R
    ] = 
  map (MIMP_RULE o SPEC_ALL o REWRITE_RULE[IMP_CONJ]) 
    (CONJUNCTS chRULES);;
 #+end_src

If we are doing construction proofs, it help to be able to instantiate variables of type ~Lambda~ easily using metavariables from the proof state. These shortcut methods greatly facilitate this:

#+begin_src ocaml :results silent
let lamConstruct p st = 
  let construct m =
    if (String.equal p ((fst o dest_var) m)) 
    then instantiate (top_inst st) m
    else failwith "Not found!" in
  tryfind construct (top_metas st);;

let top_constr s = lamConstruct s (p());;
#+end_src

Finally, we mentioned earlier how we sometimes need to provide a typed ~mempty~. Our types have started becoming quite verbose (and are still variable), so we write a quick function to make this easier:

#+begin_src ocaml :results silent
let chEmpty ty = inst [ty,`:A`] `mempty:(((A)Lambda)TTerm)multiset` ;;
#+end_src

Now we are ready to do some proofs!

