docs/CurryHoward.html

<div id="outline-container-orga7d77d3" class="outline-4">
<h4 id="orga7d77d3"><span class="section-number-4">3.1.3</span> Inference Rules</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
As before, we introduce an infix operator for logical consequence, i.e. the &ldquo;<i>turnstile</i>&rdquo;. We use a different symbol so that both embedding can co-exist:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">parse_as_infix<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"|=="</span>,<span style="color: #66D9EF;">(</span>11,<span style="color: #E6DB74;">"right"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
We introduce the inference rules in the same way and order as before:
</p>
<ol class="org-ol">
<li>Identity (<code>ID</code>)</li>
<li>Weakening (<code>W</code>)</li>
<li>Contraction (<code>C</code>)</li>
<li>Cut (<code>Cut</code>)</li>
<li>Conjunction Right (<code>RX</code>)</li>
<li>Conjunction Left1 (<code>L1X</code>)</li>
<li>Conjunction Left2 (<code>L2X</code>)</li>
<li>Implication Left (<code>L--&gt;</code>)</li>
<li>Implication Right (<code>R--&gt;</code>)</li>
</ol>

<div class="org-src-container">
<pre class="src src-ocaml"><span class="linenr"> 0: </span><span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #FD971F;">chRULES</span>,<span style="color: #FD971F;">chINDUCT</span>,<span style="color: #FD971F;">chCASES</span> = new_inductive_definition 
<span class="linenr"> 1: </span>`<span style="color: #AE81FF;">(</span><span style="color: #F8F8F0;">!</span>a x. ' <span style="color: #66D9EF;">(</span>x <span style="color: #F8F8F2; background-color: #272822;">::</span> a<span style="color: #66D9EF;">)</span> <span style="color: #F8F8F0;">|==</span> x <span style="color: #F8F8F2; background-color: #272822;">::</span> a<span style="color: #AE81FF;">)</span> /\
<span class="linenr"> 2: </span><span style="color: #AE81FF;">(</span><span style="color: #F8F8F0;">!</span><span style="color: #F8F8F2; background-color: #272822;">G</span> a c x z. <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">|==</span> z <span style="color: #F8F8F2; background-color: #272822;">::</span> c<span style="color: #66D9EF;">)</span> ==&gt; <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' <span style="color: #A6E22E;">(</span>x <span style="color: #F8F8F2; background-color: #272822;">::</span> a<span style="color: #A6E22E;">)</span> <span style="color: #F8F8F0;">|==</span> z <span style="color: #F8F8F2; background-color: #272822;">::</span> c<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> /\
<span class="linenr"> 3: </span><span style="color: #AE81FF;">(</span><span style="color: #F8F8F0;">!</span><span style="color: #F8F8F2; background-color: #272822;">G</span> a c x z. <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> '<span style="color: #A6E22E;">(</span>x <span style="color: #F8F8F2; background-color: #272822;">::</span> a<span style="color: #A6E22E;">)</span> <span style="color: #F8F8F0;">^</span> '<span style="color: #A6E22E;">(</span>x <span style="color: #F8F8F2; background-color: #272822;">::</span> a<span style="color: #A6E22E;">)</span> <span style="color: #F8F8F0;">|==</span> z <span style="color: #F8F8F2; background-color: #272822;">::</span> c<span style="color: #66D9EF;">)</span> ==&gt; <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' <span style="color: #A6E22E;">(</span>x <span style="color: #F8F8F2; background-color: #272822;">::</span> a<span style="color: #A6E22E;">)</span> <span style="color: #F8F8F0;">|==</span> z <span style="color: #F8F8F2; background-color: #272822;">::</span> c<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> /\
<span class="linenr"> 4: </span><span style="color: #AE81FF;">(</span><span style="color: #F8F8F0;">!</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F2; background-color: #272822;">D</span> a c x z. <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">|==</span> z <span style="color: #F8F8F2; background-color: #272822;">::</span> a<span style="color: #66D9EF;">)</span> /\ <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">D</span> <span style="color: #F8F8F0;">^</span> ' <span style="color: #A6E22E;">(</span>z <span style="color: #F8F8F2; background-color: #272822;">::</span> a<span style="color: #A6E22E;">)</span> <span style="color: #F8F8F0;">|==</span> x <span style="color: #F8F8F2; background-color: #272822;">::</span> c<span style="color: #66D9EF;">)</span> ==&gt; <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> <span style="color: #F8F8F2; background-color: #272822;">D</span> <span style="color: #F8F8F0;">|==</span> x <span style="color: #F8F8F2; background-color: #272822;">::</span> c<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> /\
<span class="linenr"> 5: </span><span style="color: #AE81FF;">(</span><span style="color: #F8F8F0;">!</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F2; background-color: #272822;">D</span> a b x y. <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">|==</span> x <span style="color: #F8F8F2; background-color: #272822;">::</span> a<span style="color: #66D9EF;">)</span> /\ <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">D</span> <span style="color: #F8F8F0;">|==</span> y <span style="color: #F8F8F2; background-color: #272822;">::</span> b<span style="color: #66D9EF;">)</span> ==&gt; <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> <span style="color: #F8F8F2; background-color: #272822;">D</span> <span style="color: #F8F8F0;">|==</span> <span style="color: #F8F8F2; background-color: #272822;">Prod</span> <span style="color: #A6E22E;">(</span>x,y<span style="color: #A6E22E;">)</span> <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #A6E22E;">(</span>a <span style="color: #F8F8F0;">%</span> b<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> /\
<span class="linenr"> 6: </span><span style="color: #AE81FF;">(</span><span style="color: #F8F8F0;">!</span><span style="color: #F8F8F2; background-color: #272822;">G</span> a b c x z. <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' <span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">Fst</span> x <span style="color: #F8F8F2; background-color: #272822;">::</span> a<span style="color: #A6E22E;">)</span> <span style="color: #F8F8F0;">|==</span> <span style="color: #A6E22E;">(</span>z <span style="color: #F8F8F2; background-color: #272822;">::</span> c<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span> ==&gt; <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' <span style="color: #A6E22E;">(</span>x <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #E6DB74;">(</span>a <span style="color: #F8F8F0;">%</span> b<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span> <span style="color: #F8F8F0;">|==</span> <span style="color: #A6E22E;">(</span>z <span style="color: #F8F8F2; background-color: #272822;">::</span> c<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> /\
<span class="linenr"> 7: </span><span style="color: #AE81FF;">(</span><span style="color: #F8F8F0;">!</span><span style="color: #F8F8F2; background-color: #272822;">G</span> a b c x z. <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' <span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">Snd</span> x <span style="color: #F8F8F2; background-color: #272822;">::</span> b<span style="color: #A6E22E;">)</span> <span style="color: #F8F8F0;">|==</span> <span style="color: #A6E22E;">(</span>z <span style="color: #F8F8F2; background-color: #272822;">::</span> c<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span> ==&gt; <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' <span style="color: #A6E22E;">(</span>x <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #E6DB74;">(</span>a <span style="color: #F8F8F0;">%</span> b<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span> <span style="color: #F8F8F0;">|==</span> <span style="color: #A6E22E;">(</span>z <span style="color: #F8F8F2; background-color: #272822;">::</span> c<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> /\
<span class="linenr"> 8: </span><span style="color: #AE81FF;">(</span><span style="color: #F8F8F0;">!</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F2; background-color: #272822;">D</span> a b c f y z. <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' <span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">(</span>f <span style="color: #F8F8F0;">@@</span> y<span style="color: #E6DB74;">)</span> <span style="color: #F8F8F2; background-color: #272822;">::</span> b<span style="color: #A6E22E;">)</span> <span style="color: #F8F8F0;">|==</span> z <span style="color: #F8F8F2; background-color: #272822;">::</span> c<span style="color: #66D9EF;">)</span> /\ <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">D</span> <span style="color: #F8F8F0;">|==</span> <span style="color: #A6E22E;">(</span>y <span style="color: #F8F8F2; background-color: #272822;">::</span> a<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span> ==&gt; <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> <span style="color: #F8F8F2; background-color: #272822;">D</span> <span style="color: #F8F8F0;">^</span> ' <span style="color: #A6E22E;">(</span>f <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #E6DB74;">(</span>a --&gt; b<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span> <span style="color: #F8F8F0;">|==</span> z <span style="color: #F8F8F2; background-color: #272822;">::</span> c<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> /\
<span class="linenr"> 9: </span><span style="color: #AE81FF;">(</span><span style="color: #F8F8F0;">!</span><span style="color: #F8F8F2; background-color: #272822;">G</span> a b x y. <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' <span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">Var</span> x <span style="color: #F8F8F2; background-color: #272822;">::</span> a<span style="color: #A6E22E;">)</span> <span style="color: #F8F8F0;">|==</span> <span style="color: #A6E22E;">(</span>y <span style="color: #F8F8F2; background-color: #272822;">::</span> b<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span> ==&gt; <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">|==</span> <span style="color: #F8F8F2; background-color: #272822;">Lam</span> x y <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #A6E22E;">(</span>a --&gt; b<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span class="linenr">10: </span>` <span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
The only difference is that we use annotated terms (~TTerm~s) instead of propositions (~Prop~s), so we include the corresponding Curry-Howard terms in each rule.
</p>

<p>
As before, we break up and pre-process our rules, ready for use in our system:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #AE81FF;">[</span><span style="color: #FD971F;">chID</span>;
     <span style="color: #FD971F;">chW</span>; <span style="color: #FD971F;">chC</span>; <span style="color: #FD971F;">chCut</span>; 
     <span style="color: #FD971F;">chX_R</span>; <span style="color: #FD971F;">chX_L1</span>; <span style="color: #FD971F;">chX_L2</span>;
     <span style="color: #FD971F;">chI_L</span>; <span style="color: #FD971F;">chI_R</span>
    <span style="color: #AE81FF;">]</span> = 
  map <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">MIMP_RULE</span> o <span style="color: #F8F8F2; background-color: #272822;">SPEC_ALL</span> o <span style="color: #F8F8F2; background-color: #272822;">REWRITE_RULE</span><span style="color: #66D9EF;">[</span><span style="color: #F8F8F2; background-color: #272822;">IMP_CONJ</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span> 
    <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">CONJUNCTS</span> chRULES<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
If we are doing construction proofs, it help to be able to instantiate variables of type <code>Lambda</code> easily using metavariables from the proof state. These shortcut methods greatly facilitate this:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #A6E22E;">lamConstruct</span> <span style="color: #FD971F;">p</span> <span style="color: #FD971F;">st</span> = 
  <span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #A6E22E;">construct</span> <span style="color: #FD971F;">m</span> =
    <span style="color: #F92672;">if</span> <span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">String.</span>equal p <span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span>fst o dest_var<span style="color: #A6E22E;">)</span> m<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> 
    <span style="color: #F92672;">then</span> instantiate <span style="color: #AE81FF;">(</span>top_inst st<span style="color: #AE81FF;">)</span> m
    <span style="color: #F92672;">else</span> <span style="color: #F92672;">failwith</span> <span style="color: #E6DB74;">"Not found!"</span> <span style="color: #FD5FF0; font-weight: bold;">in</span>
  tryfind construct <span style="color: #AE81FF;">(</span>top_metas st<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>

<span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #A6E22E;">top_constr</span> <span style="color: #FD971F;">s</span> = lamConstruct s <span style="color: #AE81FF;">(</span>p<span style="color: #66D9EF;">()</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
Finally, we mentioned earlier how we sometimes need to provide a typed <code>mempty</code>. Our types have started becoming quite verbose (and are still variable), so we write a quick function to make this easier:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #A6E22E;">chEmpty</span> <span style="color: #FD971F;">ty</span> = inst <span style="color: #AE81FF;">[</span>ty,`:<span style="color: #F8F8F2; background-color: #272822;">A</span>`<span style="color: #AE81FF;">]</span> <span style="color: #F8F8F2; background-color: #272822;">`mempty</span>:<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">A</span><span style="color: #A6E22E;">)</span><span style="color: #F8F8F2; background-color: #272822;">Lambda</span><span style="color: #66D9EF;">)</span><span style="color: #F8F8F2; background-color: #272822;">TTerm</span><span style="color: #AE81FF;">)</span>multiset` <span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
Now we are ready to do some proofs!
</p>
</div>
</div>
</div>
