Examples/CurryHoward.org
** Proofs

*** A Construction Proof 

We revisit the same proof from before. Now we want to find which lambda term matches this particular type. We use existential quantification at the meta-level (HOL):
#+begin_src ocaml
g `?P. mempty |== P :: (X % Y --> Y % X)` ;;
#+end_src

#+RESULTS:
: Warning: inventing type variables
: Warning: Free variables in goal: X, Y
: val it : goalstack = 1 subgoal (1 total)
: 
: `?P. mempty |== X % Y --> Y % X`

The ~META_EXISTS_TAC~ tactic gets rid of the the existential quantifier, but adds the variable ~P~ as a metavariable. This allows us to instantiate it as the proof progresses:

#+begin_src ocaml
e (META_EXISTS_TAC);;
#+end_src

#+RESULTS:
: val it : goalstack = 1 subgoal (1 total)
: Metas: `(P:(?125766)Lambda)`;
: 
: `mempty |== X % Y --> Y % X`

The rest of the proof progresses exactly as before. Especially given that we have hidden the lamdba terms, there is virtually no difference in the proof process:

#+begin_src ocaml
eseq (ruleseq chI_R);;
#+end_src

#+RESULTS:
: val it : goalstack = 1 subgoal (1 total)
: Metas: `(x0:?125766)`; `(y0:(?125766)Lambda)`; `(P:(?125766)Lambda)`;
: 
: `' X % Y |== Y % X`

#+begin_src ocaml
eseq (ruleseq chC);; 
#+end_src

#+RESULTS:
: val it : goalstack = 1 subgoal (1 total)
: Metas: `(x0:?125766)`; `(y0:(?125766)Lambda)`; `(P:(?125766)Lambda)`;
: 
: `' X % Y^' X % Y |== Y % X`

Do not be fooled, however. This is Curry-Howard in all its glory!

#+begin_src ocaml
show_lam();;
p();;
#+end_src

#+RESULTS:
: val it : goalstack = 1 subgoal (1 total)
: Metas: `(x0:?125766)`; `(y0:(?125766)Lambda)`; `(P:(?125766)Lambda)`;
: 
: `' (Var x0 :: (X % Y))^' (Var x0 :: (X % Y)) |== y0 :: (Y % X)`

#+begin_src ocaml
eseq (ruleseq chX_R);;
#+end_src

#+RESULTS:
: val it : goalstack = 2 subgoals (2 total)
: Metas: `(x2:(?125766)Lambda)`; `(y2:(?125766)Lambda)`; `(x0:?125766)`; `(y0:(?125766)Lambda)`; `(P:(?125766)Lambda)`;
: 
: `' (Var x0 :: (X % Y)) |== y2 :: X`
: 
: `' (Var x0 :: (X % Y)) |== x2 :: Y`

#+begin_src ocaml
eseq (ruleseq chX_L2);; 
#+end_src

#+RESULTS:
: val it : goalstack = 1 subgoal (2 total)
: Metas: `(x2:(?125766)Lambda)`; `(y2:(?125766)Lambda)`; `(x0:?125766)`; `(y0:(?125766)Lambda)`; `(P:(?125766)Lambda)`;
: 
: `' (Snd (Var x0) :: Y) |== x2 :: Y`

#+begin_src ocaml
eseq (ruleseq chID);; 
#+end_src

#+RESULTS:
: val it : goalstack = 1 subgoal (1 total)
: Metas: `(x2:(?125766)Lambda)`; `(y2:(?125766)Lambda)`; `(x0:?125766)`; `(y0:(?125766)Lambda)`; `(P:(?125766)Lambda)`;
: 
: `' (Var x0 :: (X % Y)) |== y2 :: X`

We can hide the lambda terms again at any point.

#+begin_src ocaml
hide_lam();;
eseq (ruleseq chX_L1);;
eseq (ruleseq chID);;
#+end_src

#+RESULTS:
: val it : goalstack = No subgoals
: Metas: `(x2:(?125766)Lambda)`; `(y2:(?125766)Lambda)`; `(x0:?125766)`; `(y0:(?125766)Lambda)`; `(P:(?125766)Lambda)`;

Our proof is complete and we can generate out theorem, though the existential quantifier makes is hardly usable. Validating the proof, however, is quite important, to ensure the delayed metavariable instantiation are still sound:

#+begin_src ocaml
top_thm();;
#+end_src

#+RESULTS:
: val it : thm = |- ?P. mempty |== X % Y --> Y % X

What is more interesting is that we can instantiate the original metavariable ~P~ to construct our lamdba term:
#+begin_src ocaml
top_constr "P";;
#+end_src

#+RESULTS:
: val it : term = `Lam x0 (Prod (Snd (Var x0),Fst (Var x0)))`

This is a direct translation of the proof we just performed into lambda calculus! It is a function that takes an argument ~x0~ (assumed to be a product) and returns a product with ~x0~'s elements flipped (~Snd~ followed by ~Fst~). This was all constructed automatically for us.

*** A Type-checking Proof

If we replace ~P~ in the previous goal with the term we constructed, we can start a type-checking proof, to prove that ~P~ does indeed have the right type:
#+begin_src ocaml
g `mempty |== Lam x (Prod (Snd (Var x),Fst (Var x))) :: (X % Y --> Y % X)` ;;
#+end_src

#+RESULTS:
: Warning: inventing type variables
: Warning: Free variables in goal: X, Y, x
: val it : goalstack = 1 subgoal (1 total)
: 
: `mempty |== X % Y --> Y % X`

We can follow the exact same proof as before:

#+begin_src ocaml
eseq (ruleseq chI_R);;
eseq (ruleseq chC);;
eseq (ruleseq chX_R);;
eseq (ruleseq chX_L2);;
eseq (ruleseq chID);;
eseq (ruleseq chX_L1);;
eseq (ruleseq chID);;
#+end_src

#+RESULTS:
: val it : goalstack = No subgoals

And once we are done, we can obtain a theorem, proving our type is correct:

#+begin_src ocaml
show_lam();;
top_thm();;
#+end_src

#+RESULTS:
: val it : thm =
:   |- mempty |== Lam x (Prod (Snd (Var x),Fst (Var x))) :: (X % Y --> Y % X)

#+begin_src ocaml :results silent
hide_lam();;
#+end_src


