docs/CurryHoward.html

<div id="outline-container-orgd94c0a1" class="outline-3">
<h3 id="orgd94c0a1"><span class="section-number-3">3.2</span> Proofs</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org1f50656" class="outline-4">
<h4 id="org1f50656"><span class="section-number-4">3.2.1</span> A Construction Proof</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
We revisit the same proof from before. Now we want to find which lambda term matches this particular type. We use existential quantification at the meta-level (HOL):
</p>
<div class="org-src-container">
<pre class="src src-ocaml">g `?<span style="color: #66D9EF;">P.</span> mempty <span style="color: #F8F8F0;">|==</span> <span style="color: #F8F8F2; background-color: #272822;">P</span> <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">X</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">Y</span> --&gt; <span style="color: #F8F8F2; background-color: #272822;">Y</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">X</span><span style="color: #AE81FF;">)</span>` <span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
Warning: inventing type variables
Warning: Free variables in goal: X, Y
val it : goalstack = 1 subgoal (1 total)

`?P. mempty |== X % Y --&gt; Y % X`
</pre>


<p>
The <code>META_EXISTS_TAC</code> tactic gets rid of the the existential quantifier, but adds the variable <code>P</code> as a metavariable. This allows us to instantiate it as the proof progresses:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">e <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">META_EXISTS_TAC</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (1 total)
Metas: `(P:(?125766)Lambda)`;

`mempty |== X % Y --&gt; Y % X`
</pre>


<p>
The rest of the proof progresses exactly as before. Especially given that we have hidden the lamdba terms, there is virtually no difference in the proof process:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">eseq <span style="color: #AE81FF;">(</span>ruleseq chI_R<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (1 total)
Metas: `(x0:?125766)`; `(y0:(?125766)Lambda)`; `(P:(?125766)Lambda)`;

`' X % Y |== Y % X`
</pre>


<div class="org-src-container">
<pre class="src src-ocaml">eseq <span style="color: #AE81FF;">(</span>ruleseq chC<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span> 
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (1 total)
Metas: `(x0:?125766)`; `(y0:(?125766)Lambda)`; `(P:(?125766)Lambda)`;

`' X % Y^' X % Y |== Y % X`
</pre>


<p>
Do not be fooled, however. This is Curry-Howard in all its glory!
</p>

<div class="org-src-container">
<pre class="src src-ocaml">show_lam<span style="color: #AE81FF;">()</span><span style="color: #ff4500;">;;</span>
p<span style="color: #AE81FF;">()</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (1 total)
Metas: `(x0:?125766)`; `(y0:(?125766)Lambda)`; `(P:(?125766)Lambda)`;

`' (Var x0 :: (X % Y))^' (Var x0 :: (X % Y)) |== y0 :: (Y % X)`
</pre>


<div class="org-src-container">
<pre class="src src-ocaml">eseq <span style="color: #AE81FF;">(</span>ruleseq chX_R<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 2 subgoals (2 total)
Metas: `(x2:(?125766)Lambda)`; `(y2:(?125766)Lambda)`; `(x0:?125766)`; `(y0:(?125766)Lambda)`; `(P:(?125766)Lambda)`;

`' (Var x0 :: (X % Y)) |== y2 :: X`

`' (Var x0 :: (X % Y)) |== x2 :: Y`
</pre>


<div class="org-src-container">
<pre class="src src-ocaml">eseq <span style="color: #AE81FF;">(</span>ruleseq chX_L2<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span> 
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (2 total)
Metas: `(x2:(?125766)Lambda)`; `(y2:(?125766)Lambda)`; `(x0:?125766)`; `(y0:(?125766)Lambda)`; `(P:(?125766)Lambda)`;

`' (Snd (Var x0) :: Y) |== x2 :: Y`
</pre>


<div class="org-src-container">
<pre class="src src-ocaml">eseq <span style="color: #AE81FF;">(</span>ruleseq chID<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span> 
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (1 total)
Metas: `(x2:(?125766)Lambda)`; `(y2:(?125766)Lambda)`; `(x0:?125766)`; `(y0:(?125766)Lambda)`; `(P:(?125766)Lambda)`;

`' (Var x0 :: (X % Y)) |== y2 :: X`
</pre>


<p>
We can hide the lambda terms again at any point.
</p>

<div class="org-src-container">
<pre class="src src-ocaml">hide_lam<span style="color: #AE81FF;">()</span><span style="color: #ff4500;">;;</span>
eseq <span style="color: #AE81FF;">(</span>ruleseq chX_L1<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
eseq <span style="color: #AE81FF;">(</span>ruleseq chID<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = No subgoals
Metas: `(x2:(?125766)Lambda)`; `(y2:(?125766)Lambda)`; `(x0:?125766)`; `(y0:(?125766)Lambda)`; `(P:(?125766)Lambda)`;
</pre>


<p>
Our proof is complete and we can generate out theorem, though the existential quantifier makes is hardly usable. Validating the proof, however, is quite important, to ensure the delayed metavariable instantiation are still sound:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">top_thm<span style="color: #AE81FF;">()</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : thm = |- ?P. mempty |== X % Y --&gt; Y % X
</pre>


<p>
What is more interesting is that we can instantiate the original metavariable <code>P</code> to construct our lamdba term:
</p>
<div class="org-src-container">
<pre class="src src-ocaml">top_constr <span style="color: #E6DB74;">"P"</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : term = `Lam x0 (Prod (Snd (Var x0),Fst (Var x0)))`
</pre>


<p>
This is a direct translation of the proof we just performed into lambda calculus! It is a function that takes an argument <code>x0</code> (assumed to be a product) and returns a product with <code>x0</code>&rsquo;s elements flipped (<code>Snd</code> followed by <code>Fst</code>). This was all constructed automatically for us.
</p>
</div>
</div>

<div id="outline-container-org2441c29" class="outline-4">
<h4 id="org2441c29"><span class="section-number-4">3.2.2</span> A Type-checking Proof</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
If we replace <code>P</code> in the previous goal with the term we constructed, we can start a type-checking proof, to prove that <code>P</code> does indeed have the right type:
</p>
<div class="org-src-container">
<pre class="src src-ocaml">g <span style="color: #F8F8F2; background-color: #272822;">`mempty</span> <span style="color: #F8F8F0;">|==</span> <span style="color: #F8F8F2; background-color: #272822;">Lam</span> x <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">Prod</span> <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">Snd</span> <span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">Var</span> x<span style="color: #A6E22E;">)</span>,<span style="color: #F8F8F2; background-color: #272822;">Fst</span> <span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">Var</span> x<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">X</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">Y</span> --&gt; <span style="color: #F8F8F2; background-color: #272822;">Y</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">X</span><span style="color: #AE81FF;">)</span>` <span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
Warning: inventing type variables
Warning: Free variables in goal: X, Y, x
val it : goalstack = 1 subgoal (1 total)

`mempty |== X % Y --&gt; Y % X`
</pre>


<p>
We can follow the exact same proof as before:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">eseq <span style="color: #AE81FF;">(</span>ruleseq chI_R<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
eseq <span style="color: #AE81FF;">(</span>ruleseq chC<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
eseq <span style="color: #AE81FF;">(</span>ruleseq chX_R<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
eseq <span style="color: #AE81FF;">(</span>ruleseq chX_L2<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
eseq <span style="color: #AE81FF;">(</span>ruleseq chID<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
eseq <span style="color: #AE81FF;">(</span>ruleseq chX_L1<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
eseq <span style="color: #AE81FF;">(</span>ruleseq chID<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = No subgoals
</pre>


<p>
And once we are done, we can obtain a theorem, proving our type is correct:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">show_lam<span style="color: #AE81FF;">()</span><span style="color: #ff4500;">;;</span>
top_thm<span style="color: #AE81FF;">()</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : thm =
  |- mempty |== Lam x (Prod (Snd (Var x),Fst (Var x))) :: (X % Y --&gt; Y % X)
</pre>


<div class="org-src-container">
<pre class="src src-ocaml">hide_lam<span style="color: #AE81FF;">()</span><span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
