Examples/CurryHoward.org
*** Proving and Reusing Lemmas

So far, we have been looking at interactive proofs. Our tactics can be packaged in the traditional HOL Light style. However, we use our own, extended tacticals, which unfortunately cannot be infix (at least until we find a way to add this to camlp5).

Here is a packaged proof of commutativity of conjunction (without the implication this time):

#+begin_src ocaml
let TIMES_COMM = prove_seq( `' (a :: (X % Y)) |== Prod (Snd a, Fst a) :: (Y % X)` ,
                            ETHENL 
                              (ETHEN (ruleseq chC) (ruleseq chX_R))
                              [
                                ETHEN (ruleseq chX_L2) (ruleseq chID);
                                ETHEN (ruleseq chX_L1) (ruleseq chID) ]
                   );;
#+end_src

#+RESULTS:
: Warning: inventing type variables
: val TIMES_COMM : thm = |- ' (a :: (X % Y)) |== Prod (Snd a,Fst a) :: (Y % X)

Lemmas like this are only useful if we can employ them in other proofs. Given our convenient tactics, it would be nice if we could use lemmas like this to derive new inference rules.

In this particular case, we can construct an inference rule that commutes a conjunction on the right-hand side (and later on the left-hand side) of the sequent. The rule can be expressed like this:

#+begin_example
`G |== a :: (X % Y) ===> G |== b :: (Y % X)`
#+end_example

The question is, what is the appropriate Curry-Howard translation for this rule? In other words, what should the lambda terms ~a~ and ~b~ be?

A construction proof can give the answer quite easily:

#+begin_src ocaml
g `?a:(A)Lambda b. G |== a :: (X % Y) ===> G |== b :: (Y % X)` ;;
e (REPEAT META_EXISTS_TAC);;
e (MDISCH_TAC);;
#+end_src

#+RESULTS:
: val it : goalstack = 1 subgoal (1 total)
: Metas: `(a:(A)Lambda)`; `(b:(A)Lambda)`;
: 
:   0 [`G |== X % Y`]
: 
: `G |== Y % X`

Note that ~MDISCH_TAC~ is an Isabelle Light tactic. It is the same as ~DISCH_TAC~, but for our special meta-implication.

At this point we need to make smart use of ~Cut~ in order to apply our ~TIMES_COMM~ lemma. Doing this in vanilla HOL Light would be quite tedious. Our rule instantiation mechanics make it very easy:

#+begin_src ocaml
eseq (drule_seqtac [`c`,`Y % X`;`D`,chEmpty `:A`] chCut);; (* cut! *)
#+end_src

#+RESULTS:
#+begin_example
Warning: inventing type variables
Warning: inventing type variables
val it : goalstack = 2 subgoals (2 total)
Metas: `(x0:(A)Lambda)`; `(a:(A)Lambda)`; `(b:(A)Lambda)`;

  0 [`G |== Y % X`]

`G |== Y % X`

`' X % Y |== Y % X`
#+end_example

Now the first (bottom) goal matches our lemma exactly, whereas the second one matches the assumption. Then we are done!

#+begin_src ocaml
eseq (ruleseq TIMES_COMM);; (* Using the lemma we proved earlier *)
eseq (seqassumption);;
top_thm();;
#+end_src

#+RESULTS:
: val it : thm = |- ?a b. G |== X % Y ===> G |== Y % X

Based on this proof, ~a~ is just itself:
#+begin_src ocaml
top_constr "a" ;; 
#+end_src

#+RESULTS:
: val it : term = `a`

And given that, ~b~ should be ~a~ with the elements swapped:

#+begin_src ocaml
top_constr "b" ;; 
#+end_src

#+RESULTS:
: val it : term = `Prod (Snd a,Fst a)`

Replace the constructed ~a~ and ~b~ in the original goal, and package the proof:
#+begin_src ocaml
let chTimesCommR = prove_seq (`G |== a:(A)Lambda :: (X % Y) ===>
                                         G |== Prod (Snd a,Fst a) :: (Y % X)` ,
				                       ETHENL ( ETHEN
				                                  (ETAC (MDISCH_TAC))
				                                  (drule_seqtac [`c`,`Y % X`;`D`,chEmpty `:A`] chCut) ) [
				                           ruleseq TIMES_COMM;
				                           seqassumption]);;
#+end_src

#+RESULTS:
: Warning: inventing type variables
: Warning: inventing type variables
: val chTimesCommR : thm = |- G |== X % Y ===> G |== Y % X

And /voila/! A brand new, derived inference rule!

Let's do the same for the left-hand side. First construct our lambda terms:

#+begin_src ocaml
g `?a:(A)Lambda b. G ^ ' (a :: (X % Y)) |== z :: C  ===> G ^ ' (b :: (Y % X)) |== z :: C` ;;
e (REPEAT META_EXISTS_TAC);;
e (MDISCH_TAC);;
eseq (rule_seqtac [`a`,`X % Y`;`G`,`' (b :: (Y % X))`] chCut);;
eseq (ruleseq TIMES_COMM);;
eseq (seqassumption);;
top_thm();;
top_constr "a";;
#+end_src

#+RESULTS:
: val it : term = `Prod (Snd b,Fst b)`

And then instantiate the rule and package the proof:

#+begin_src ocaml
let chTimesCommL = prove_seq (`G ^ ' (Prod (Snd a,Fst a) :: (X % Y)) |== z :: C  ===>
                                G ^ ' (a :: (Y % X)) |== z :: C` ,
				              ETHENL ( ETHEN
				                         (ETAC (MDISCH_TAC))
				                         (rule_seqtac [`a`,`X % Y`;`G`,`' (a :: (Y % X))`] chCut) ) [
				                  ruleseq TIMES_COMM;
				                  seqassumption]);;
#+end_src

#+RESULTS:
: Warning: inventing type variables
: Warning: inventing type variables
: Warning: inventing type variables
: Warning: inventing type variables
: val chTimesCommL : thm = |- G^' X % Y |== C ===> G^' Y % X |== C

Now that we have 2 new inference rules, let's see them in action in a new proof:

#+begin_src ocaml
g `? P. mempty |== P :: (((A % B) % C) --> (C % (B % A)))` ;;
e (REPEAT META_EXISTS_TAC);;
eseq (ruleseq chI_R);;
#+end_src

#+RESULTS:
: val it : goalstack = 1 subgoal (1 total)
: Metas: `(x0:?126353)`; `(y0:(?126353)Lambda)`; `(P:(?126353)Lambda)`;
: 
: `' (A % B) % C |== C % B % A`

Let's swap things on the right-hand side:

#+begin_src ocaml
eseq (ruleseq chTimesCommR);;
#+end_src

#+RESULTS:
: val it : goalstack = 1 subgoal (1 total)
: Metas: `(a1:(?126353)Lambda)`; `(x0:?126353)`; `(y0:(?126353)Lambda)`; `(P:(?126353)Lambda)`;
: 
: `' (A % B) % C |== (B % A) % C`

Keep going:

#+begin_src ocaml
eseq (ruleseq chC);;
eseq (ruleseq chX_R);;

eseq (ruleseq chX_L1);;
#+end_src

#+RESULTS:
: val it : goalstack = 1 subgoal (2 total)
: Metas: `(x3:(?126353)Lambda)`; `(y3:(?126353)Lambda)`; `(a1:(?126353)Lambda)`; `(x0:?126353)`; `(y0:(?126353)Lambda)`; `(P:(?126353)Lambda)`;
: 
: `' A % B |== B % A`

The perfect goal to use ~chTimesCommL~:

#+begin_src ocaml
eseq (ruleseq chTimesCommL);;
#+end_src

#+RESULTS:
: val it : goalstack = 1 subgoal (2 total)
: Metas: `(x3:(?126353)Lambda)`; `(y3:(?126353)Lambda)`; `(a1:(?126353)Lambda)`; `(x0:?126353)`; `(y0:(?126353)Lambda)`; `(P:(?126353)Lambda)`;
: 
: `' B % A |== B % A`


The rest is straightforward:

#+begin_src ocaml
eseq (ruleseq chID);;

eseq (ruleseq chX_L2);;
eseq (ruleseq chID);;

top_thm();;
#+end_src

#+RESULTS:
: val it : thm = |- ?P. mempty |== (A % B) % C --> C % B % A

And why not construct the lambda term for this slightly more complex type?

#+begin_src ocaml
top_constr "P";; 
#+end_src

#+RESULTS:
: val it : term =
:   `Lam x0
:    (Prod
:    (Snd (Prod (Prod (Snd (Fst (Var x0)),Fst (Fst (Var x0))),Snd (Var x0))),
:     Fst (Prod (Prod (Snd (Fst (Var x0)),Fst (Fst (Var x0))),Snd (Var x0)))))`

Due to the (implicit) cuts, our constructed term can be reduced with rewritting:

#+begin_src ocaml
REWRITE_CONV[lamFst;lamSnd] (top_constr "P");; 
#+end_src

#+RESULTS:
: val it : thm =
:   |- Lam x0
:      (Prod
:      (Snd (Prod (Prod (Snd (Fst (Var x0)),Fst (Fst (Var x0))),Snd (Var x0))),
:       Fst (Prod (Prod (Snd (Fst (Var x0)),Fst (Fst (Var x0))),Snd (Var x0))))) =
:      Lam x0
:      (Prod (Snd (Var x0),Prod (Snd (Fst (Var x0)),Fst (Fst (Var x0)))))

If ~Fst~ and ~Snd~ were primitive constructors, we would not be able to use rewritting like this, nor can we define a notion of cut elimination.

We could also define function application as a function in HOL instead of a primitive constructor. However, this would require a definition of variable substitution, which in turn would require managing bound variables. This is notoriously hard, especially with the limited features of HOL Light, and therefore beyond the scope of our tutorial. Other theorem provers (such as Isabelle or HOL4) which support appropriate mechanisms (Higher Order Abstract Syntax, de Bruijn indexes etc.) would be more suitable for this purpose.
