docs/CurryHoward.html


<div id="outline-container-org9172a6d" class="outline-4">
<h4 id="org9172a6d"><span class="section-number-4">3.2.3</span> Proving and Reusing Lemmas</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
So far, we have been looking at interactive proofs. Our tactics can be packaged in the traditional HOL Light style. However, we use our own, extended tacticals, which unfortunately cannot be infix (at least until we find a way to add this to camlp5).
</p>

<p>
Here is a packaged proof of commutativity of conjunction (without the implication this time):
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #F8F8F2; background-color: #272822;">TIMES_COMM</span> = prove_seq<span style="color: #AE81FF;">(</span> `' <span style="color: #66D9EF;">(</span>a <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">X</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">Y</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span> <span style="color: #F8F8F0;">|==</span> <span style="color: #F8F8F2; background-color: #272822;">Prod</span> <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">Snd</span> a, <span style="color: #F8F8F2; background-color: #272822;">Fst</span> a<span style="color: #66D9EF;">)</span> <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">Y</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">X</span><span style="color: #66D9EF;">)</span>` ,
                            <span style="color: #F8F8F2; background-color: #272822;">ETHENL</span> 
                              <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">ETHEN</span> <span style="color: #A6E22E;">(</span>ruleseq chC<span style="color: #A6E22E;">)</span> <span style="color: #A6E22E;">(</span>ruleseq chX_R<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
                              <span style="color: #66D9EF;">[</span>
                                <span style="color: #F8F8F2; background-color: #272822;">ETHEN</span> <span style="color: #A6E22E;">(</span>ruleseq chX_L2<span style="color: #A6E22E;">)</span> <span style="color: #A6E22E;">(</span>ruleseq chID<span style="color: #A6E22E;">)</span>;
                                <span style="color: #F8F8F2; background-color: #272822;">ETHEN</span> <span style="color: #A6E22E;">(</span>ruleseq chX_L1<span style="color: #A6E22E;">)</span> <span style="color: #A6E22E;">(</span>ruleseq chID<span style="color: #A6E22E;">)</span> <span style="color: #66D9EF;">]</span>
                   <span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
Warning: inventing type variables
val TIMES_COMM : thm = |- ' (a :: (X % Y)) |== Prod (Snd a,Fst a) :: (Y % X)
</pre>


<p>
Lemmas like this are only useful if we can employ them in other proofs. Given our convenient tactics, it would be nice if we could use lemmas like this to derive new inference rules.
</p>

<p>
In this particular case, we can construct an inference rule that commutes a conjunction on the right-hand side (and later on the left-hand side) of the sequent. The rule can be expressed like this:
</p>

<pre class="example" id="org32bf7e4">
`G |== a :: (X % Y) ===&gt; G |== b :: (Y % X)`
</pre>

<p>
The question is, what is the appropriate Curry-Howard translation for this rule? In other words, what should the lambda terms <code>a</code> and <code>b</code> be?
</p>

<p>
A construction proof can give the answer quite easily:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">g `<span style="color: #AE81FF;">?a</span>:<span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">A</span><span style="color: #AE81FF;">)</span><span style="color: #F8F8F2; background-color: #272822;">Lambda</span> b. <span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">|==</span> a <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">X</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">Y</span><span style="color: #AE81FF;">)</span> ===&gt; <span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">|==</span> b <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">Y</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">X</span><span style="color: #AE81FF;">)</span>` <span style="color: #ff4500;">;;</span>
e <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">REPEAT</span> <span style="color: #F8F8F2; background-color: #272822;">META_EXISTS_TAC</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
e <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">MDISCH_TAC</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (1 total)
Metas: `(a:(A)Lambda)`; `(b:(A)Lambda)`;

  0 [`G |== X % Y`]

`G |== Y % X`
</pre>


<p>
Note that <code>MDISCH_TAC</code> is an Isabelle Light tactic. It is the same as <code>DISCH_TAC</code>, but for our special meta-implication.
</p>

<p>
At this point we need to make smart use of <code>Cut</code> in order to apply our <code>TIMES_COMM</code> lemma. Doing this in vanilla HOL Light would be quite tedious. Our rule instantiation mechanics make it very easy:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">eseq <span style="color: #AE81FF;">(</span>drule_seqtac <span style="color: #66D9EF;">[</span><span style="color: #F8F8F2; background-color: #272822;">`c</span>`,<span style="color: #F8F8F2; background-color: #272822;">`Y</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">X</span>`;<span style="color: #F8F8F2; background-color: #272822;">`D</span>`,chEmpty `:<span style="color: #66D9EF;">A`</span><span style="color: #66D9EF;">]</span><span style="color: #66D9EF;"> chCut</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span> <span style="color: #75715E;">(* </span><span style="color: #75715E;">cut! </span><span style="color: #75715E;">*)</span>
</pre>
</div>

<pre class="example" id="org6a41f68">
Warning: inventing type variables
Warning: inventing type variables
val it : goalstack = 2 subgoals (2 total)
Metas: `(x0:(A)Lambda)`; `(a:(A)Lambda)`; `(b:(A)Lambda)`;

  0 [`G |== Y % X`]

`G |== Y % X`

`' X % Y |== Y % X`
</pre>

<p>
Now the first (bottom) goal matches our lemma exactly, whereas the second one matches the assumption. Then we are done!
</p>

<div class="org-src-container">
<pre class="src src-ocaml">eseq <span style="color: #AE81FF;">(</span>ruleseq <span style="color: #F8F8F2; background-color: #272822;">TIMES_COMM</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span> <span style="color: #75715E;">(* </span><span style="color: #75715E;">Using the lemma we proved earlier </span><span style="color: #75715E;">*)</span>
eseq <span style="color: #AE81FF;">(</span>seqassumption<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
top_thm<span style="color: #AE81FF;">()</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : thm = |- ?a b. G |== X % Y ===&gt; G |== Y % X
</pre>


<p>
Based on this proof, <code>a</code> is just itself:
</p>
<div class="org-src-container">
<pre class="src src-ocaml">top_constr <span style="color: #E6DB74;">"a"</span> <span style="color: #ff4500;">;;</span> 
</pre>
</div>

<pre class="example">
val it : term = `a`
</pre>


<p>
And given that, <code>b</code> should be <code>a</code> with the elements swapped:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">top_constr <span style="color: #E6DB74;">"b"</span> <span style="color: #ff4500;">;;</span> 
</pre>
</div>

<pre class="example">
val it : term = `Prod (Snd a,Fst a)`
</pre>


<p>
Replace the constructed <code>a</code> and <code>b</code> in the original goal, and package the proof:
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #FD971F;">chTimesCommR</span> = prove_seq <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">`G</span> <span style="color: #F8F8F0;">|==</span> a:<span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">A</span><span style="color: #66D9EF;">)</span><span style="color: #66D9EF;">Lambda :: </span><span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">X % Y</span><span style="color: #66D9EF;">)</span><span style="color: #66D9EF;"> ===&gt;</span>
<span style="color: #66D9EF;">                                         G |== Prod </span><span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">Snd a,Fst a</span><span style="color: #66D9EF;">)</span><span style="color: #66D9EF;"> :: </span><span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">Y % X</span><span style="color: #66D9EF;">)</span><span style="color: #66D9EF;">` ,</span>
<span style="color: #66D9EF;">                                       ETHENL </span><span style="color: #66D9EF;">(</span><span style="color: #66D9EF;"> ETHEN</span>
<span style="color: #66D9EF;">                                                  </span><span style="color: #A6E22E;">(</span><span style="color: #66D9EF;">ETAC </span><span style="color: #E6DB74;">(</span><span style="color: #66D9EF;">MDISCH_TAC</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
<span style="color: #66D9EF;">                                                  </span><span style="color: #A6E22E;">(</span><span style="color: #66D9EF;">drule_seqtac </span><span style="color: #E6DB74;">[</span><span style="color: #66D9EF;">`c`,`Y % X`;`D`,chEmpty `:A`</span><span style="color: #E6DB74;">]</span><span style="color: #66D9EF;"> chCut</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;"> </span><span style="color: #66D9EF;">)</span><span style="color: #66D9EF;"> </span><span style="color: #66D9EF;">[</span>
<span style="color: #66D9EF;">                                           ruleseq TIMES_COMM;</span>
<span style="color: #66D9EF;">                                           seqassumption</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
Warning: inventing type variables
Warning: inventing type variables
val chTimesCommR : thm = |- G |== X % Y ===&gt; G |== Y % X
</pre>


<p>
And <i>voila</i>! A brand new, derived inference rule!
</p>

<p>
Let&rsquo;s do the same for the left-hand side. First construct our lambda terms:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">g `<span style="color: #AE81FF;">?a</span>:<span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">A</span><span style="color: #AE81FF;">)</span><span style="color: #F8F8F2; background-color: #272822;">Lambda</span> b. <span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' <span style="color: #AE81FF;">(</span>a <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">X</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">Y</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> <span style="color: #F8F8F0;">|==</span> z <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #F8F8F2; background-color: #272822;">C</span>  ===&gt; <span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' <span style="color: #AE81FF;">(</span>b <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">Y</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">X</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> <span style="color: #F8F8F0;">|==</span> z <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #F8F8F2; background-color: #272822;">C</span>` <span style="color: #ff4500;">;;</span>
e <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">REPEAT</span> <span style="color: #F8F8F2; background-color: #272822;">META_EXISTS_TAC</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
e <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">MDISCH_TAC</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
eseq <span style="color: #AE81FF;">(</span>rule_seqtac <span style="color: #66D9EF;">[</span><span style="color: #F8F8F2; background-color: #272822;">`a</span>`,<span style="color: #F8F8F2; background-color: #272822;">`X</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">Y</span>`;<span style="color: #F8F8F2; background-color: #272822;">`G</span>`,`' <span style="color: #A6E22E;">(</span>b <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #E6DB74;">(</span><span style="color: #F8F8F2; background-color: #272822;">Y</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">X</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>`<span style="color: #66D9EF;">]</span> chCut<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
eseq <span style="color: #AE81FF;">(</span>ruleseq <span style="color: #F8F8F2; background-color: #272822;">TIMES_COMM</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
eseq <span style="color: #AE81FF;">(</span>seqassumption<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
top_thm<span style="color: #AE81FF;">()</span><span style="color: #ff4500;">;;</span>
top_constr <span style="color: #E6DB74;">"a"</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : term = `Prod (Snd b,Fst b)`
</pre>


<p>
And then instantiate the rule and package the proof:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">show_lam<span style="color: #AE81FF;">()</span><span style="color: #ff4500;">;;</span>
<span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #FD971F;">chTimesCommL</span> = prove_seq <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">`G</span> <span style="color: #F8F8F0;">^</span> ' <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">Prod</span> <span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">Snd</span> a,<span style="color: #F8F8F2; background-color: #272822;">Fst</span> a<span style="color: #A6E22E;">)</span> <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">X</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">Y</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span> <span style="color: #F8F8F0;">|==</span> z <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #F8F8F2; background-color: #272822;">C</span>  ===&gt;
                                <span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' <span style="color: #66D9EF;">(</span>a <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">Y</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">X</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span> <span style="color: #F8F8F0;">|==</span> z <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #F8F8F2; background-color: #272822;">C</span>` ,
                              <span style="color: #F8F8F2; background-color: #272822;">ETHENL</span> <span style="color: #66D9EF;">(</span> <span style="color: #F8F8F2; background-color: #272822;">ETHEN</span>
                                         <span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">ETAC</span> <span style="color: #E6DB74;">(</span><span style="color: #F8F8F2; background-color: #272822;">MDISCH_TAC</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
                                         <span style="color: #A6E22E;">(</span>rule_seqtac <span style="color: #E6DB74;">[</span><span style="color: #F8F8F2; background-color: #272822;">`a</span>`,<span style="color: #F8F8F2; background-color: #272822;">`X</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">Y</span>`;<span style="color: #F8F8F2; background-color: #272822;">`G</span>`,`' <span style="color: #FD971F;">(</span>a <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #F92672;">(</span><span style="color: #F8F8F2; background-color: #272822;">Y</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">X</span><span style="color: #F92672;">)</span><span style="color: #FD971F;">)</span>`<span style="color: #E6DB74;">]</span> chCut<span style="color: #A6E22E;">)</span> <span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">[</span>
                                  ruleseq <span style="color: #F8F8F2; background-color: #272822;">TIMES_COMM</span>;
                                  seqassumption<span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
Warning: inventing type variables
Warning: inventing type variables
Warning: inventing type variables
Warning: inventing type variables
val chTimesCommL : thm =
  |- G^' (Prod (Snd a,Fst a) :: (X % Y)) |== z :: C ===&gt;
     G^' (a :: (Y % X)) |== z :: C
</pre>


<p>
We can do the same without explicitly stating the computational terms we want to construct. This way, if we change anything in the correspondence, the lemma will still be proven:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #FD5FF0; font-weight: bold;">let</span> <span style="color: #FD971F;">chTimesCommL</span> = constr_prove <span style="color: #AE81FF;">(</span>`?a b. <span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' <span style="color: #66D9EF;">(</span>b <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">X</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">Y</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span> <span style="color: #F8F8F0;">|==</span> z <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #F8F8F2; background-color: #272822;">C</span>  ===&gt;
                                   <span style="color: #F8F8F2; background-color: #272822;">G</span> <span style="color: #F8F8F0;">^</span> ' <span style="color: #66D9EF;">(</span>a <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">Y</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">X</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span> <span style="color: #F8F8F0;">|==</span> z <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #F8F8F2; background-color: #272822;">C</span>` ,
                                 <span style="color: #F8F8F2; background-color: #272822;">ETHENL</span> <span style="color: #66D9EF;">(</span> <span style="color: #F8F8F2; background-color: #272822;">ETHEN</span> <span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">SEQTAC</span> <span style="color: #F8F8F2; background-color: #272822;">MDISCH_TAC</span><span style="color: #A6E22E;">)</span>
                                            <span style="color: #A6E22E;">(</span>rule_seqtac <span style="color: #E6DB74;">[</span><span style="color: #F8F8F2; background-color: #272822;">`a</span>`,<span style="color: #F8F8F2; background-color: #272822;">`X</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">Y</span>`;<span style="color: #F8F8F2; background-color: #272822;">`G</span>`,`' <span style="color: #FD971F;">(</span>a <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #F92672;">(</span><span style="color: #F8F8F2; background-color: #272822;">Y</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">X</span><span style="color: #F92672;">)</span><span style="color: #FD971F;">)</span>`<span style="color: #E6DB74;">]</span> chCut<span style="color: #A6E22E;">)</span> <span style="color: #66D9EF;">)</span> 
                                   <span style="color: #66D9EF;">[</span>
                                     ruleseq <span style="color: #F8F8F2; background-color: #272822;">TIMES_COMM</span>;
                                     seqassumption
                                   <span style="color: #66D9EF;">]</span>
                     <span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
Warning: inventing type variables
Warning: inventing type variables
Warning: inventing type variables
Warning: inventing type variables
val chTimesCommL : thm =
  |- G^' (Prod (Snd a,Fst a) :: (X % Y)) |== z :: C ===&gt;
     G^' (a :: (Y % X)) |== z :: C
</pre>


<p>
Now that we have 2 new inference rules, let&rsquo;s see them in action in a new proof:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">hide_lam<span style="color: #AE81FF;">()</span><span style="color: #ff4500;">;;</span>
g `? <span style="color: #66D9EF;">P.</span> mempty <span style="color: #F8F8F0;">|==</span> <span style="color: #F8F8F2; background-color: #272822;">P</span> <span style="color: #F8F8F2; background-color: #272822;">::</span> <span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">A</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">B</span><span style="color: #A6E22E;">)</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">C</span><span style="color: #66D9EF;">)</span> --&gt; <span style="color: #66D9EF;">(</span><span style="color: #F8F8F2; background-color: #272822;">C</span> <span style="color: #F8F8F0;">%</span> <span style="color: #A6E22E;">(</span><span style="color: #F8F8F2; background-color: #272822;">B</span> <span style="color: #F8F8F0;">%</span> <span style="color: #F8F8F2; background-color: #272822;">A</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>` <span style="color: #ff4500;">;;</span>
e <span style="color: #AE81FF;">(</span><span style="color: #F8F8F2; background-color: #272822;">REPEAT</span> <span style="color: #F8F8F2; background-color: #272822;">META_EXISTS_TAC</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
eseq <span style="color: #AE81FF;">(</span>ruleseq chI_R<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (1 total)
Metas: `(x0:?126376)`; `(y0:(?126376)Lambda)`; `(P:(?126376)Lambda)`;

`' (A % B) % C |== C % B % A`
</pre>


<p>
Let&rsquo;s swap things on the right-hand side:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">eseq <span style="color: #AE81FF;">(</span>ruleseq chTimesCommR<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (1 total)
Metas: `(a1:(?126376)Lambda)`; `(x0:?126376)`; `(y0:(?126376)Lambda)`; `(P:(?126376)Lambda)`;

`' (A % B) % C |== (B % A) % C`
</pre>


<p>
Keep going:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">eseq <span style="color: #AE81FF;">(</span>ruleseq chC<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
eseq <span style="color: #AE81FF;">(</span>ruleseq chX_R<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>

eseq <span style="color: #AE81FF;">(</span>ruleseq chX_L1<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (2 total)
Metas: `(x3:(?126376)Lambda)`; `(y3:(?126376)Lambda)`; `(a1:(?126376)Lambda)`; `(x0:?126376)`; `(y0:(?126376)Lambda)`; `(P:(?126376)Lambda)`;

`' A % B |== B % A`
</pre>


<p>
The perfect goal to use <code>chTimesCommL</code>:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">eseq <span style="color: #AE81FF;">(</span>ruleseq chTimesCommL<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : goalstack = 1 subgoal (2 total)
Metas: `(x3:(?126376)Lambda)`; `(y3:(?126376)Lambda)`; `(a1:(?126376)Lambda)`; `(x0:?126376)`; `(y0:(?126376)Lambda)`; `(P:(?126376)Lambda)`;

`' B % A |== B % A`
</pre>



<p>
The rest is straightforward:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">eseq <span style="color: #AE81FF;">(</span>ruleseq chID<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>

eseq <span style="color: #AE81FF;">(</span>ruleseq chX_L2<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>
eseq <span style="color: #AE81FF;">(</span>ruleseq chID<span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span>

top_thm<span style="color: #AE81FF;">()</span><span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
val it : thm = |- ?P. mempty |== (A % B) % C --&gt; C % B % A
</pre>


<p>
And why not construct the lambda term for this slightly more complex type?
</p>

<div class="org-src-container">
<pre class="src src-ocaml">top_constr <span style="color: #E6DB74;">"P"</span><span style="color: #ff4500;">;;</span> 
</pre>
</div>

<pre class="example">
val it : term =
  `Lam x0
   (Prod
   (Snd (Prod (Prod (Snd (Fst (Var x0)),Fst (Fst (Var x0))),Snd (Var x0))),
    Fst (Prod (Prod (Snd (Fst (Var x0)),Fst (Fst (Var x0))),Snd (Var x0)))))`
</pre>


<p>
Due to the (implicit) cuts, our constructed term can be reduced with rewritting:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #F8F8F2; background-color: #272822;">REWRITE_CONV</span><span style="color: #AE81FF;">[</span>lamFst;lamSnd<span style="color: #AE81FF;">]</span> <span style="color: #AE81FF;">(</span>top_constr <span style="color: #E6DB74;">"P"</span><span style="color: #AE81FF;">)</span><span style="color: #ff4500;">;;</span> 
</pre>
</div>

<pre class="example">
val it : thm =
  |- Lam x0
     (Prod
     (Snd (Prod (Prod (Snd (Fst (Var x0)),Fst (Fst (Var x0))),Snd (Var x0))),
      Fst (Prod (Prod (Snd (Fst (Var x0)),Fst (Fst (Var x0))),Snd (Var x0))))) =
     Lam x0
     (Prod (Snd (Var x0),Prod (Snd (Fst (Var x0)),Fst (Fst (Var x0)))))
</pre>


<p>
If <code>Fst</code> and <code>Snd</code> were primitive constructors, we would not be able to use rewritting like this, nor can we define a notion of cut elimination.
</p>

<p>
We could also define function application as a function in HOL instead of a primitive constructor. However, this would require a definition of variable substitution, which in turn would require managing bound variables. This is notoriously hard, especially with the limited features of HOL Light, and therefore beyond the scope of our tutorial. Other theorem provers (such as Isabelle or HOL4) which support appropriate mechanisms (Higher Order Abstract Syntax, de Bruijn indexes etc.) would be more suitable for this purpose.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Petros Papapanagiotou</p>
<p class="date">Created: 2020-12-06 Sun 16:18</p>
</div>
</body>
</html>
